{
  "resolutions" :
  [
    {
      "my_resolutions": true,
      "icon": "/icons/runningIcon.png",
      "backdrop": "/backdrops/runningIcon.jpg",
      "type": "physical",
      "color": "green",
      "image_ref": "running",
      "title": "Running",
      "overview": "Running has so many benefits: it relieves stress, strengthens your muscles, and makes your body lean. It's hard work at first, but after a few weeks your body finds its rhythm and you begin to crave the feeling of running free. You can start running right away and build up your endurance with a bit of persistence and hard work.",
      "steps": [
        {
          "id": 1,
          "locked": false,
          "completed": true,
          "label": "Get the correct gears",
          "description": [
            "When you're just starting out, you don't need fancy running shoes. An old pair of sneakers will do. Once you know you want to continue the sport, you can upgrade. Run in comfortable clothes. Put on gym shorts, a T-shirt, and a sports bra if necessary. Don't wear anything too constricting."
          ],
          "notes": [
            {
              "image": "",
              "note": "I am wearing my regular running shoes. They aren't the best but they are good enough.",
              "date": "2021-01-02T16:54:20.593Z"
            },
            {
              "image": "",
              "note": "I had recently bought a track suit. Glad it came handy.",
              "date": "2021-01-02T16:58:20.593Z"
            }
          ]
        },
        {
          "id": 2,
          "locked": false,
          "completed": false,
          "label": "Just get out there",
          "description": [
            "The best way to start running is simply to hit the pavement, dirt or grass. The motion of running will feel strange at first, as muscles that normally don't get much use spring into awkward action. This is normal. Run until your legs are burning and your chest is heaving; for true beginners, that usually occurs after about 5-10 minutes.",
            "Make sure to use good form. Try to loosen your body and move forward in a way that feels natural. It's best to run more on the toe or front of your foot, running on the heel will increase your chance of shin splints. Avoid bouncing and try to land softly in order to reduce stress on your knees and other joints. Relax your upper body. Keep your weight centered and your shoulders in a relaxed position, with your arms bent at 90 degrees."
          ],
          "notes": [
            {
              "image": "",
              "note": "I have finally started running as of today. I ran out of gas quite quickly but it's a start.",
              "date": "2021-01-03T16:54:20.593Z"
            }
          ]
        },
        {
          "id": 3,
          "locked": true,
          "completed": false,
          "label": "Improve your breathing",
          "description": [
            "Breathe naturally or focus on a breathing technique. Some argue that the best breathing technique is inhaling oxygen through the nose, fully expanding the lungs, and exhaling through a widely opened mouth. Your nose is a good filter for air, especially while running outdoors, which prevents you from accidentally swallowing bugs. Exhaling through your mouth allows your body to get rid of more carbon dioxide and heat with less effort.",
            "Bonus: Although the benefits and/or drawbacks to stretching before a run are controversial, there is little argument about the benefits of stretching at the end of each workout. Stretch out each muscle group, holding each stretch for at least 15-20 seconds."
          ],
          "notes": []
        },
        {
          "id": 4,
          "locked": true,
          "completed": false,
          "label": "Create a routine",
          "description": [
            "Run at least three days a week. This is how you build endurance; running once a week won't cut it. Space out the days to allow for recovery time between sessions.",
            "Stay hydrated and eat light before running. Good rule of thumb is to eat 200-300 calories about 1.5 hours before the run.",
            "Bonus: Try listening to music during your run. It won't work for everyone, but in some cases, it may help you maintain a steady pace."
          ],
          "notes": []
        },
        {
          "id": 5,
          "locked": true,
          "completed": false,
          "label": "Modify your routine",
          "description": [
            "Add time and distance. As the weeks go on, push yourself to run further and for a longer period of time. If you ran 10 minutes at a time the first week, push yourself to do 15 the second week. Make it 20 the third week. You'll soon find that you're able to go much longer before you feel like you have to stop.",
            "Don't worry about speed at first. In fact, you should really run more slowly than you think you should. You're not running a race yet; you're increasing your fitness level.",
            "Alternate running and walking. Rather than stopping your exercise session when you feel like you have to stop, walk for a few minutes, then start running again.",
            "Do sprints. Running as fast as you can for a short period of time builds up your muscles and helps you gain endurance. Mix up your long running sessions with sprinting days.",
            "Bonus: Map out some favorite routes. Running the same boring track day in and day out is going to make you feel burned out pretty soon."
          ],
          "notes": []
        },
        {
          "id": 6,
          "locked": true,
          "completed": false,
          "label": "Advance to Intermediate level",
          "description": [
            "Obtain some good running shoes. If you're serious about running, it's a good idea to get the right shoes that makes you feel comfortable.",
            "Train for a race.Competing in a race gives you a goal to work toward as you're learning to run. Once you've done one, you'll probably want to do more.",
            "Join a running group. Running with other seasoned runners will give you the opportunity to get feedback on your form, and provide motivation to stick with it. You can run races together or just run for recreational purposes."
          ],
          "notes": []
        }
      ],
      "reference": "https://www.wikihow.com/Begin-Running"
    },
    {
      "my_resolutions": true,
      "icon": "/icons/readingIcon.png",
      "backdrop": "/backdrops/readingBackdrop.jpg",
      "image_ref": "reading",
      "type": "intellectual",
      "color": "purple",
      "title": "Reading",
      "overview": "Books have been scientifically proven to improve vocabulary, grades, imagination, and even just your happiness. Unfortunately, not everybody enjoys it, which can be quite devastating to your future - you can't escape reading! But making reading a hobby that you enjoy will make anything better. You can go anywhere with a book in hand, so keep reading if you want to enjoy reading.",
      "steps": [
        {
          "id": 1,
          "locked": false,
          "completed": false,
          "label": "Pick the right book",
          "description": [
            "What is your favourite genre? Reading what you like is often the key to liking reading. If you don't like chocolate cake, it doesn't mean you don't like all types of cake. It's the same with reading."
          ],
          "notes": []
        },
        {
          "id": 2,
          "locked": true,
          "completed": false,
          "label": "Ask your friends and family about their favourite books",
          "description": [
            "You can start learning about different varieties of books, and this can give you some ideas on where to look. Also, ask what these other people like about reading, and why that is."
          ],
          "notes": []
        },
        {
          "id": 3,
          "locked": true,
          "completed": false,
          "label": "Read the book about your favourite movie",
          "description": [
            "A lot of times, a movie is based on a book and because the screen version can only be so long, by reading the book, you get more details!"
          ],
          "notes": []
        },
        {
          "id": 4,
          "locked": true,
          "completed": false,
          "label": "Find a comfier place to read",
          "description": [
            "If you're always itchy or achy while reading, you probably won't enjoy your book! Choose a clean, quiet area that will be easy to focus in."
          ],
          "notes": []
        },
        {
          "id": 5,
          "locked": true,
          "completed": false,
          "label": "Relax",
          "description": [
            "Take a couple of deep breaths before reading and have something hot to drink near you. Relaxing is a great way to enjoy lots of things.",
            "If you're having a hard time finding a quiet place, try a backyard or park. The outdoors are always great."
          ],
          "notes": []
        },
        {
          "id": 6,
          "locked": true,
          "completed": false,
          "label": "Understand what you are reading",
          "description": [
            "Find a reading level for you. If you don't know the words or expressions, you will find the book very dull and frustrating."
          ],
          "notes": []
        },
        {
          "id": 7,
          "locked": true,
          "completed": false,
          "label": "Connect with the story",
          "description": [
            "Ask yourself what each character enjoys doing the most. Try connecting it to you by comparing your hobbies, talents, likes, and dislikes. Also, think if you would change the character at all."
          ],
          "notes": []
        },
        {
          "id": 8,
          "locked": true,
          "completed": false,
          "label": "Make all reading enjoyable",
          "description": [
            "If you only read because you have to, change that. Don't pick a super boring book about the subject. Go to the library and try historical fiction based on the subject! It can be easier to digest and enjoy, but still be educational! When you're looking for books on a certain subject, ask the librarian for help."
          ],
          "notes": []
        },
        {
          "id": 9,
          "locked": true,
          "completed": false,
          "label": "Plan time for reading",
          "description": [
            "Keep everything balanced so you have time to read a little bit at least. You can never enjoy reading if you never do it."
          ],
          "notes": []
        },
        {
          "id": 10,
          "locked": true,
          "completed": false,
          "label": "Set goals",
          "description": [
            "Try reading one page every day for a week, and challenge yourself to read two pages the next! Work your way up until you're at a comfortable amount of time for you."
          ],
          "notes": []
        }
      ],
      "reference": "https://www.wikihow.com/Enjoy-Reading-Books"
    },
    {
      "my_resolutions": true,
      "icon": "/icons/quitSmokingIcon.png",
      "backdrop": "/backdrops/quitSmokingBackdrop.jpg",
      "image_ref": "quitSmoking",
      "type": "quitting",
      "color": "red",
      "title": "Quit Smoking",
      "overview": "Nicotine is one of the most harmful and widely available legal drugs in the world. It's addictive and harmful both to smokers and the people passively exposed to smoke, especially children. Quitting smoking is difficult, but not impossible.",
      "steps": [
        {
          "id": 1,
          "locked": false,
          "completed": true,
          "label": "The decision",
          "description": [
            "Think about if you want to quit smoking. Consider how smoking affects these areas of your life: your health, your appearance, your lifestyle, and your loved ones. Ask yourself if these areas would benefit from you quitting.",
            "Determine why you want to quit. Make a list of all the reasons why you want to quit. This will help you become clear about your decision to quit. You'll want to refer to this list later, if you're tempted to smoke.",
            "Write notes here stating all the reasons you want to quit smoking for."
          ],
          "notes": []
        },
        {
          "id": 2,
          "locked": false,
          "completed": true,
          "label": "Plan it out",
          "description": [
            "Choose a date for when your plan will start. Pick a date within the next 2 weeks. This gives you time to prepare and start on a day that isn't stressful, important, would otherwise lead you to smoke.",
            "Pick a method. Decide which method you would want to use. Completely stop smoking without looking back or smoke less and less until you've stopped. You'll have a better chance of success if you combine counseling and medication with stopping, regardless of which method you choose.",
            "Prepare for cravings. Have a plan in advance for when cravings strike. Have a replacement to fulfill this need. Try snacking on low-calorie snacks, like raisins, popcorn, or pretzels, when this urge comes up.",
            "You might try exercising to combat cravings. Go for a walk, clean the kitchen, or do some yoga. You might also try to control your impulses by squeezing a stress ball or chewing gum when cravings hit."
          ],
          "notes": []
        },
        {
          "id": 3,
          "locked": false,
          "completed": true,
          "label": "Carrying Out Your Plan",
          "description": [
            "Prepare the night before quitting. Wash your bedding and clothes to get rid of cigarette smells. You should also get rid of any ashtrays, cigarettes, and lighters from your house. Make sure to get plenty of sleep, since this will help lower your stress.",
            "Remind yourself of your plan and carry a written version with you, or keep it on your phone. You may also want to re-read the list of reasons why you want to quit.",
            "Ask for support. Your family and friends can be extra support in your cessation journey. Let them know your goal and ask them to help you by not smoking around you or offering you a cigarette.",
            "Know your triggers. Many people find that certain situations trigger the desire to smoke. You might want a cigarette with your cup of coffee, for instance, or you might want to smoke when you're trying to solve a problem at work. Identify places where it may be difficult not to smoke and have a plan of what you'll do in those specific places.",
            "Control stress. Stress can be a pitfall when trying to quit smoking. Use techniques such as deep breathing, exercise, and down time to help thwart stress."
          ],
          "notes": []
        },
        {
          "id": 4,
          "locked": false,
          "completed": false,
          "label": "Be committed to not smoking",
          "description": [
            "Continue your plan even if you have bumps in the road. If you have a relapse and smoke for an entire day, be sure to be gentle and forgiving with yourself. Accept that the day was tough, remind yourself that quitting is a long, hard journey, and get back on your plan the next day.",
            "Try to avoid relapsing as much as possible. But if you do, recommit as soon as you can to quitting smoking. Learn from your experience and try to cope better in the future."
          ],
          "notes": []
        },
        {
          "id": 5,
          "locked": true,
          "completed": false,
          "label": "Other alternatives",
          "description": [
            "If you are finding super hard even at this stage to quit smoking, you can use these other alternatives that can be helpful.",
            "Consider using e-cigarettes or nicotine filters. Recent studies have suggested that using e-cigarettes while you quit smoking can help you reduce or quit smoking. Other studies recommend caution when using e-cigarettes since the amount of nicotine varies, the same chemicals as those in cigarettes are still being delivered, and they may re-activate the habit of smoking.",
            "Get professional help. Behavioral therapy combined with medication therapy can improve your chances of successfully quitting. Your doctor can talk to you about medication therapy.",
            "Take Bupropion. This medication doesn't actually have nicotine, but it does help reduce the symptoms of nicotine withdrawal. Bupropion could increase your chances of cessation by 69 percent. Side effects include: dry mouth, difficulty sleeping, agitation, irritability, tiredness, indigestion and headaches as side effects. Consult your doctor.",
            "Use Chantix. This medication curbs nicotine receptors in the brain, which makes smoking less pleasurable. It also reduces withdrawal symptoms. Side effects include: headaches, nausea, vomiting, trouble sleeping, unusual dreams, gas, and changes in taste. Consult your doctor.",
            "Try nicotine replacement therapy (NRT). NRT includes all types of patches, gums, lozenges, nasal sprays, inhalers or sublingual tablets that have and deliver nicotine into the body. You don't need a prescription for NRT and it can reduce cravings and withdrawal symptoms. NRT could increase your chances of quitting by 60 percent."
          ],
          "notes": []
        }
      ],
      "reference": "https://www.wikihow.com/Quit-Smoking"
    },
    {
      "my_resolutions": false,
      "icon": "/icons/swimmingIcon.png",
      "backdrop": "/backdrops/swimmingBackdrop.jpg",
      "image_ref": "swimming",
      "type": "physical",
      "color": "green",
      "title": "Swimming",
      "overview": "Swimming is a great way to get fit, lose weight, and tone your muscles. It is best to start your swimming routine slowly and then gradually increase the length and duration of your swims. Before you start swimming, try to get acquainted with the basic etiquette and consider joining a club or getting lessons.",
      "steps": [
        {
          "id": 1,
          "locked": true,
          "completed": false,
          "label": "Learn the Basics",
          "description": [
            "Swim in the novice lane until you increase your speed and endurance. Each swimming lane will have a sign in front of it indicating the speed. Swimming in a fast lane if you’re just starting out will be frustrating for both you and those who you’re swimming with. Start in the novice lane and then move up to the next lane once you find the pace of the novice lane too slow.",
            "Swim up 1 side of the lane and back down the other. If there are multiple people swimming in 1 lane, it is etiquette to swim up 1 side and then back on the other in a circular rotation. This helps to stop collisions in the lanes and makes it safer and easier for people to swim.",
            "Join a swimming group to help you keep motivated. This is a great way to meet some like-minded friends and to help keep up your enthusiasm. Ask your local pools if they have a swimming group that meets regularly. Most pools will have both social and competitive groups.",
            "Consider attending a few swimming lessons to improve your technique. If this is your first time swimming or you’re recovering from injuries, try taking a few lessons to help you learn the basics and avoid injuries.",
            "Start with basic gear, including a bathing suit and goggles. Don’t worry about splashing out and spending lots of money on fancy equipment. All you need to get started is a bathing suit, goggles, and a swim cap if you have long hair. Purchase swimming gear from the pools or a sports store."
          ],
          "notes": []
        },
        {
          "id": 2,
          "locked": true,
          "completed": false,
          "label": "Create a routine",
          "description": [
            "Aim to swim 3 - 5 times a week. This amount of training helps to improve your strength and fitness, which allows you to swim further and faster each week. If you find that your muscles are getting really sore, start by swimming 3 times a week and then increase the frequency of your swims once your muscles get used to the routine.",
            "Start and finish each work out with a warm up and cool down. This helps to prevent injuries and sore muscles. Try to slowly swim about 100 metres (330 ft) before you get into your swimming programme and then swim a similar distance after you finish your training. Make sure to swim in a slow, relaxed manner to help gently stretch your muscles.",
            "If you are unable to swim 100 metres (330 ft) when you start out, try swimming 25 metres (82 ft) or 50 metres (160 ft) until your fitness increases.",
            "These laps are the same as the ones that you complete during your workout; however, they are designed to be swam more slowly."
          ],
          "notes": []
        },
        {
          "id": 3,
          "locked": true,
          "completed": false,
          "label": "Upgrade your routine",
          "description": [
            "Increase your distance by 10% each week. It is best to increase the distance that you swim slowly, as this helps to prevent injuries that occur as a result of over-exertion. This will also help to keep you motivated, as the increased distances shouldn’t feel overwhelming.",
            "Incorporate different strokes into your routine to add variety. If you find freestyle a little monotonous, try adding breaststroke, backstroke, side-stroke, and butterfly into your routine. These will help to make your workouts more interesting and will also help to strengthen different muscles.",
            "If you aren’t confident at swimming different strokes, try doing a few lengths with just kicking or just using your arms to mix up your routine."
          ],
          "notes": []
        },
        {
          "id": 4,
          "locked": true,
          "completed": false,
          "label": "1,000m Swim Plan",
          "description": [
            "Swim 2 slow laps and then catch your breath. This warms up your muscles and helps to prevent your body from feeling sore later. Complete the laps in whatever stroke you wish. Don’t worry about trying to swim fast, simply allow your body to warm up.",
            "Alternate between 1 fast lap and 1 easy lap of freestyle 5 times. Swim 1 lap as fast as you can and then swim a slow recovery lap. This helps to increase your heart rate and your anaerobic fitness. If you need to, take a short break to catch your breath after you’ve completed 5 sets.",
            "Swim 2 laps of just kicking. Push off the wall with your feet and let your arms hang by your side. Kick your feet as hard as you can to propel yourself through the water. This helps to strengthen your leg muscles.",
            "Complete 4 laps of different strokes. Try to swim 4 laps without stopping. Use different strokes to help work out different muscles in your body. Experiment with breaststroke, backstroke, and freestyle. Alternate between different strokes to give your muscles a break.",
            "Catch your breath and then swim 2 slow laps. Allow your body to regulate your breathing back to a normal speed. Then, swim 2 laps really slowly to help your body cool down. This helps to prevent injuries and sore muscles."
          ],
          "notes": []
        }
      ],
      "reference": "https://www.wikihow.com/Start-Swimming"
    },
    {
      "my_resolutions": false,
      "icon": "/icons/quitDrinkingAlcoholIcon.png",
      "backdrop": "/backdrops/quitDrinkingAlcoholBackdrop.jpg",
      "image_ref": "quitDrinkingAlcohol",
      "type": "quitting",
      "color": "red",
      "title": "Quit drinking alcohol",
      "overview": "Quitting drinking has all kinds of great physical and mental health benefits, and you’ll be glad you did it. This will be a challenge, however, and you’re in for a journey ahead of you. Don’t let this discourage you. You will enjoy the positive change in your life.",
      "steps": [
        {
          "id": 1,
          "locked": true,
          "completed": false,
          "label": "Set your goals",
          "description": [
            "Write down the reasons you want to quit drinking. Add notes here listing all the reasons so you can look at it when you’re feeling tempted to drink.",
            "Establish your drinking goal. Maybe you just want to reduce the number of days you drink, or maybe you want to quit altogether. Decide what you want to achieve with your drinking habits, and set that goal from the start so it’s clear in your mind.",
            "Set a firm date that you want to stop drinking. This gives you a clear starting time to aim for. Say to yourself, “I am going to stop drinking on December 10.” Then start preparing so you’re all set to start on the day you choose.",
            "Schedule a few drinking days if you want to start slower. If you’d rather not quit cold turkey, then scaling back gradually is also a good strategy. Schedule a few days per week that you’ll drink on, like Friday and Saturday. Then abstain on all the other days. This helps you build your resistance to temptation and quit drinking more slowly.",
            "See your doctor for a health checkup before quitting. Your doctor will probably be very supportive of your plans—quitting drinking is great for your health, after all! But it’s still important to get a checkup before you start your alcohol-free journey. At your appointment, be honest with your doctor about how much you really drink. Your doctor needs that information to judge your overall health and recommend the best strategies to reach your goal."
          ],
          "notes": []
        },
        {
          "id": 2,
          "locked": true,
          "completed": false,
          "label": "Start the journey",
          "description": [
            "Remove all the alcohol from your home before your start date. If you usually keep alcohol in your home, then you’ll feel a stronger temptation to drink. You’ll be much more successful if you get rid of everything. Either give it away or pour it down the sink so there is nothing to tempt you when you officially quit.",
            "Tell all your friends and family that you’re quitting. Announcing your goal makes it feel more real and concrete for you. The people you spend time with are important sources of support for this journey. They can help motivate you and be sympathetic ears if you need them.",
            "Ask family and friends not to offer you drinks or drink around you. You’ll probably feel more tempted to drink if you see others doing it, especially when you’re just getting started. Your friends and family can help support you by not drinking while you’re around and not inviting you to events where there will be alcohol.",
            "Fill your free time with fun activities that don’t involve alcohol. When you stop drinking, you might realize how much time you spent in bars or at friends’ houses drinking. Look at this as an opportunity, because you now have more time to explore other activities. Try going to the gym more, reading, hiking, or doing anything else you love with all this spare time you have now."
          ],
          "notes": []
        },
        {
          "id": 3,
          "locked": true,
          "completed": false,
          "label": "Overcome temptation",
          "description": [
            "Identify the triggers that make you want to drink. Unfortunately, you’ll almost certainly be tempted to drink while you’re trying to quit. Each person has a personal set of triggers that makes them feel like drinking. Identify all of yours and do your best to avoid them. Common triggers include stress, being around alcohol, festive events like birthdays, or even a certain time of day.",
            "Revisit your reasons for quitting when you feel a craving. It’s easy to lose sight of your goals when you’re feeling a craving. When you’re having the urge to drink, pull out your list of reasons for quitting that you made when you started. This gives you the extra motivation to push through the temptation.",
            "Stay active to forget about temptations. Urges are much worse when you have nothing to do, so stay as busy as up you can. Schedule out your days with chores, work, errands, and healthy habits like exercise to keep your mind off alcohol.",
            "Talk yourself through an urge if you can't distract yourself. You can't always avoid your triggers, but the good news is that urges are temporary. Accept if you're having a persistent urge and analyze it. Close your eyes and focus on all the parts of your body that you feel the urge in. Describe your feelings in those areas of your body. Continue doing this for a few minutes, and your craving will gradually disappate."
          ],
          "notes": []
        },
        {
          "id": 4,
          "locked": true,
          "completed": false,
          "label": "Get support",
          "description": [
            "Call a friend or mentor when you feel like drinking. You’re not on this journey alone. Your friends and family are all there to help, and calling someone when you’re feeling tempted is a great strategy. You can ask them to remind you why you want to quit drinking, or just have a chat to distract yourself.",
            "Join a support group to help you stay on track. These groups are designed to help people just like you and provide an outlet for support. Join a local support group and attend meetings to talk with other people like yourself. You’ll feel much less alone when you’re part of a community.",
            "Detox at a treatment center if you're an alcoholic. You might go through withdrawal symptoms if you've been a heavy drinker for a long time. In this case, it's much safer to go through a professional detox program at a treatment center. This way, you can get yourself through the withdrawal period with fewer complications than if you tried it at home.",
            "Call your doctor if you’re experiencing withdrawal symptoms at home. If you were a heavy drinker, then you could go through withdrawal when you suddenly stop drinking. This usually isn’t dangerous but could be scary and uncomfortable. It’s best to call your doctor and ask what you should do if you’re going through withdrawal.",
            "Seek mental health treatment if you need it. Alcohol problems tend to go along with mental health problems—you may have been drinking to cope with feelings of depression or anxiety. If you quit drinking without getting other mental health treatment, then those feelings will still be there. Visit a professional mental health counselor to help overcome those issues as well."
          ],
          "notes": []
        }
      ],
      "reference": "https://www.wikihow.com/Quit-Drinking-Alcohol"
    },
    {
      "my_resolutions": false,
      "icon": "/icons/overcomeFearOfPublicSpeakingIcon.png",
      "backdrop": "/backdrops/overcomeFearOfPublicSpeakingBackdrop.jpg",
      "image_ref": "overcomeFearOfPublicSpeaking",
      "type": "social",
      "color": "orange",
      "title": "Overcome Fear of Public Speaking",
      "overview": "If you’re afraid of public speaking, you’re not alone. It’s totally normal to have performance anxiety when giving a speech. Fortunately, it’s possible to overcome your fear so you can give effective public speeches. Let's work!",
      "steps": [
        {
          "id": 1,
          "locked": true,
          "completed": false,
          "label": "Know your topic really well",
          "description": [
            "It’s normal to be afraid that you’ll forget something or say something wrong. Being prepared is the best way to handle this fear. Read about your topic so that you understand it well. If you have time, look for documentaries or online videos to help you deepen your understanding.",
            "When you choose a speech topic, try to pick a subject that you already know about. If you’re short on time, do an Internet search and read the first few sources that come up. However, make sure these sources are reliable."
          ],
          "notes": []
        },
        {
          "id": 2,
          "locked": true,
          "completed": false,
          "label": "Write your speech",
          "description": [
            "While you don’t need to recite your speech word-for-word, it’s helpful to write out what you want to say. Include a brief introduction of yourself and your topic. Then, write out paragraphs explaining your main points and support for them. End with a conclusion that tells audience members what to take from your speech.",
            "Variation: Make an outline of what you want to say for a quick, easy option. Write down the main points you want to make, as well as the evidence or support for those points. You can even use this outline as your notes when you give your speech."
          ],
          "notes": []
        },
        {
          "id": 3,
          "locked": true,
          "completed": false,
          "label": "Prepare an outline to guide you through your speech",
          "description": [
            "It’s helpful to have notes when you’re giving your speech to help jog your memory when you forget what to say. However, you don’t want your notes to be too long because that makes it easy to get tripped up. Instead, include the basic elements of your speech on an outline or note card. This way, you can quickly look down and see a key term to remind you what to say."
          ],
          "notes": []
        },
        {
          "id": 4,
          "locked": true,
          "completed": false,
          "label": "Practice your speech before you give it",
          "description": [
            "You’ve likely heard the saying, “Practice makes perfect,” and it’s true. While you might not give a perfect speech, practicing will help you feel confident when you step in front of the audience. Start by reading your speech aloud to yourself. When you feel ready, perform your speech in front of a mirror.",
            "If you have a time limit for your speech, time yourself when you're practicing. Then, make adjustments if you need to increase the length or cut it down.",
            "Just listen to your voice at first. Get a feel for the sound of your speech and make adjustments as necessary.",
            "When you’re in front of the mirror, practice making gestures or facial expressions. See what feels right to you."
          ],
          "notes": []
        },
        {
          "id": 5,
          "locked": true,
          "completed": false,
          "label": "Film yourself to help you improve your performance",
          "description": [
            "Use a video camera or your phone to film yourself doing your speech. Act like your phone is the audience, so use gestures and facial expressions. Then, watch the speech and look for areas you can improve. Do this several times to build your confidence. Don’t worry about the quality of the video or about anyone else seeing it. This video is just for you."
          ],
          "notes": []
        },
        {
          "id": 6,
          "locked": true,
          "completed": false,
          "label": "Present to family/friends before going public",
          "description": [
            "Pick people who will be honest about things that need improvement but are still really supportive of you. Then, perform your speech like you would for an audience. Ask them what they liked about the speech, as well as if you could improve on anything. If you’re really nervous, start with just 1 person. Then, gradually increase the number of people in your audience."
          ],
          "notes": []
        },
        {
          "id": 7,
          "locked": true,
          "completed": false,
          "label": "Deal with performance anxiety",
          "description": [
            "Smile to quickly release feel-good endorphins. The easiest way to calm down is to smile, even if it’s fake. When you smile, your body naturally releases endorphins, which makes you feel better. Fake a smile or think of something funny to help you feel better fast.",
            "Breathe deeply to help your body relax. Slowly inhale through your nose as you count to 5. Then, hold your breath for a 5 count. Finally, exhale slowly as you count to 5. Do a set of 5 slow breaths to help yourself calm down.",
            "Place your hand on your forehead to relax your fight-or-flight response. Performance anxiety can trigger your fight-or-flight response, which naturally sends your blood to your arms and legs. However, you can bring the blood back to your head by placing your hand on your forehead. Your hand will signal to your body to send your blood upward. This will help you center your thoughts for your speech.",
            "Visualize yourself giving a great speech. Visualization can make you feel like you actually experienced the thing you’re imagining. Close your eyes, then picture yourself giving your speech. Imagine that you’re doing an excellent job and everyone is excited to hear you. Then, picture yourself concluding your speech and walking away to applause.",
            "Use positive self-talk to replace negative thoughts. It’s normal to have negative thoughts about yourself before a speech, but they likely aren’t true. When you notice a negative thought, stop and acknowledge it. Then, challenge its credibility. Finally, replace it with a positive thought.",
            "Look for opportunities to practice public speaking in low-stress situations. The best way to relieve your anxiety is to get more practice, but that’s hard to do when you’re afraid. Start small by speaking in front of your friends, volunteering to speak to local clubs, or speaking to small groups in class or at work."
          ],
          "notes": []
        },
        {
          "id": 8,
          "locked": true,
          "completed": false,
          "label": "Confront your worries",
          "description": [
            "List off the specific worries that are causing your fear. Write it down or speak it aloud to help you process your worries. For instance, you might be afraid of saying the wrong thing or looking silly. Be as specific as possible about what’s making you nervous.",
            "Challenge your worries by listing the probable outcomes. Ask yourself how likely your fear is to come true. Then, imagine how your speech is likely to go. Think of the positive things that could happen. This should help you realize that your worries are unlikely to come true.",
            "Remind yourself that the audience wants you to succeed. It may feel like the audience is there to judge you, but this isn’t true. Your audience is there to hear what you have to say and learn something they can use. They want you to do a good job, so they’re on your side. Think of them as supporters.",
            "Mingle with your audience before your speech to reduce your fear. Walk through the room and introduce yourself to people. Try to meet as many people as you can. This will help you feel like one of the group, which will make you feel less worried."
          ],
          "notes": []
        },
        {
          "id": 9,
          "locked": true,
          "completed": false,
          "label": "Get additional help",
          "description": [
            "Take a public speaking class to learn how to give a good speech. Public speaking is a skill that most people have to learn. Look for a class online or at your local library, community center, or community college. You’ll learn how to prepare for a speech, how to give a good delivery, and tips for engaging your audience.",
            "Work with a therapist to overcome extreme public speaking anxiety. It’s okay to need additional help, and performance anxiety can be treated. Your therapist can teach you cognitive-behavioral strategies for confronting your anxiety and working through it. This will help you learn to identify thought and behavior patterns that are causing your performance anxiety. Then, you'll learn what to do differently to help you overcome your fear. Additionally, they’ll help you learn new ways to relax before a speech.",
            "Ask your doctor about a calming medication if nothing else helps you. Although you likely don’t need medication, sometimes it’s useful for helping you cope with performance anxiety. Talk to your doctor to find out if medication is a good choice for you. Then, take it before you give a speech to help you stay relaxed.",
            "Attend Toastmasters to practice public speaking in a supportive setting. Toastmasters is a nonprofit organization that has branches in many communities. They’ll help you build your public speaking skills and give you a safe place to practice. Look for a chapter in your area and attend their meetings."
          ],
          "notes": []
        }
      ],
      "reference": "https://www.wikihow.com/Overcome-Your-Fear-of-Public-Speaking"
    },
    {
      "my_resolutions": false,
      "icon": "/icons/startHealthyDietIcon.png",
      "backdrop": "/backdrops/startHealthyDietBackdrop.jpg",
      "image_ref": "startHealthyDiet",
      "type": "lifestyle",
      "color": "navy",
      "title": "Start Healthy Diet",
      "overview": "Many people want to start eating healthier and follow a more nutritious diet. When you're diet contains a lot of overly processed foods, high-fat foods or foods high in sugar, you increase your risk for a variety of chronic health conditions. On the other hand, a nutritious, well-balanced diet can support your immune system, healthy development, and decrease your risk for obesity, diabetes and high blood pressure.",
      "steps": [
        {
          "id": 1,
          "locked": true,
          "completed": false,
          "label": "Create a plan",
          "description": [
            "Starting a healthier diet is a great overarching goal; however, to make your goal more realistic and doable, you'll need to be more specific about what you want out of a healthy diet.",
            "It might be helpful to first think about your current diet. What's unhealthy about it? Do you need to eat more green vegetables? Do you need to drink more water? Should you snack less?",
            "Write up a list of the things you want to change, add or stop about your current diet. Use these ideas to form multiple small goals to help you reach a healthier diet.",
            "The best way to reach any goal is to start with one or two very small changes. Trying to overhaul your entire diet in a few days probably won't work well. Choose something small to work on each week. You'll be much more successful long-term."
          ],
          "notes": []
        },
        {
          "id": 2,
          "locked": true,
          "completed": false,
          "label": "Start a food journal",
          "description": [
            "After you've come up with a few goals and how you can achieve them, consider starting a food journal. This will serve as a method to track and evaluate your progress. Write all your goals in your food journal. You can review them as needed or change them as you continue to make changes to your diet.",
            "Also track all of your foods and beverages in your food journal. This will help you physically see what's missing from your diet or what you're eating too much of. Make sure to write out each breakfast, lunch, dinner, snack (even a few nibbles) and drinks you consume throughout the day. The more accurate you are, the better resource this will be.",
            "Each week in your food journal, write down the change you want to work on. For example, \"This week, I will drink eight glasses of water each day.\" At the end of the week, go back over your journal to see if you've completed this goal.",
            "There are many apps available to download on your smartphone that can help you track calories, exercise, and even how much water you drink."
          ],
          "notes": []
        },
        {
          "id": 3,
          "locked": true,
          "completed": false,
          "label": "Create a meal plan",
          "description": [
            "A meal plan is a great tool when you're trying to follow any new diet plan. These plans are your guide and blueprint to your week of meals and snacks.These can help you stay organized and on track throughout the week. You'll know exactly what you're going to have and on what day. This way you can go to the grocery store with a specific list, only buying what you plan to use in your meals for the week. ","A lot of times, a movie is based on a book and because the screen version can only be so long, by reading the book, you get more details!",
            "Also write up the corresponding grocery list to your meal plans. This will help you get in and out of the grocery store and ensure you have all the necessary ingredients at home to make all of your meals.",
            "Don't skip meals. If you currently skip meals, make sure to schedule a meal or a healthy snack for yourself at least every four hours. Skipping meals is more likely to lead to binge eating later, which contributes to weight gain."
          ],
          "notes": []
        },
        {
          "id": 4,
          "locked": true,
          "completed": false,
          "label": "Include Nutritious food",
          "description": [
            "Go for a well-balanced diet. Although there is a variety of eating styles and diet plans to follow, the most nutritious is a well-balanced diet. Make sure you have a wide variety of foods in your diet. For example, don't always choose to eat an apple as your afternoon snack. Alternate between apples, bananas or berries to increase the variety of your diet.",
            "Choose lean protein over higher fat protein sources. Protein is an essential nutrient to any nutritious diet; however, choosing leaner protein sources is advisable. Lean protein sources include poultry, eggs, low-fat dairy, pork, seafood, beans and nuts, and lower fat beef.",
            "Find ways to include five to nine servings of fruits and vegetables each day. Fruits and vegetables are an integral part of a healthful diet. These are the foods that are abundant in essential nutrients. Fruits and vegetables are both fairly low in calories, but high in nutrients (making them nutrient-dense foods).",
            "Choose whole grains over refined grains. An easy way to increase your nutrition and eat a healthier diet is by choosing 100% whole grains. These foods are much better for you than refined grains. Try whole grains like quinoa, brown rice, whole wheat pasta, millet, farro or whole wheat bread and wraps.",
            "Choose healthy sources of fat. Although fat should be monitored in your diet, there are a few types of fat that are particularly healthy and provide a variety of health benefits. Omega 3 fats and monounsaturated fats are both great for your body. They have been shown to improve cardiovascular health and improve cholesterol levels. The best sources of these healthy fats are avocados, olive oil, olives, nuts, nut butters, canola oil, chia seeds, flaxseeds and fatty fish (like salmon, tuna and mackerel).",
            "Drink adequate fluids. Although water is not necessarily its own food group or nutrient, it is an essential part of a healthy diet and a healthy body. It's typically recommended to consume at least eight 8-oz glasses (2 liters) of water daily. However, now many health professionals recommend consuming up to 13 glasses (3 liters) daily."
          ],
          "notes": []
        },
        {
          "id": 5,
          "locked": true,
          "completed": false,
          "label": "Limit unhealthy food",
          "description": [
            "Although eating a nutritious, well-balanced diet is important, it's not realistic to eat perfectly healthy every day for the rest of your life. People derive a lot of enjoyment out of eating and occasionally eating more indulgent foods.",
            "Follow the 80/20 rule. Treat yourself to an indulgent dish, glass of alcohol or larger portions occasionally. This is still considered normal and healthy eating; however, only indulge 20% of the time. Most of the time, or 80% of the time, you should be choosing healthy foods.",
            "Limit sources of added and highly processed sugars. There are certain groups of foods that you should limit and only eat in moderation. Added sugars are something that should definitely be eaten in moderation as they often no nutritional value.",
            "Limit sources of unhealthy fats. In addition to added sugars, you should also limit certain groups of foods that contain high quantities of fat. In particular, you want to avoid higher levels of saturated and trans fat. They are found in a variety of foods including pastries, cookies, cakes, margarines, pies, fast foods, fried foods, baked goods, and soy sauce.",
            "Consume limited amounts of alcohol. If you choose to drink, do so in moderation. Moderate amounts of alcohol generally do not pose health risks for most people."
          ],
          "notes": []
        }
      ],
      "reference": "https://www.wikihow.com/Start-a-Healthy-Diet"
    },
    {
      "my_resolutions": false,
      "icon": "/icons/improveCreativeThinkingIcon.png",
      "backdrop": "/backdrops/improveCreativeThinkingBackdrop.jpg",
      "image_ref": "improveCreativeThinking",
      "type": "intellectual",
      "color": "purple",
      "title": "Improve Creative thinking",
      "overview": "People often think of creativity as an ingrained feature. There is some truth to this. Some people are, by nature, more creative. However, there are a variety of ways you can bolster your creative side. Follow these steps and see your creativity improve over time.",
      "steps": [
        {
          "id": 1,
          "locked": true,
          "completed": false,
          "label": "Establish creative rituals",
          "description": [
            "Explore media outside your comfort zone. Creative minds are open to change. If you only consume a certain kind of media or entertainment, you're limiting yourself. You will not be exposed to new things and ideas, which can result in a lack of original, creative thought.",
            "Read books, articles, and blogs outside of your own industry. If you work in film, for example, read some science blogs. If you work as an engineer by day, read some poetry every night before bed.",
            "Most people have a certain type of entertainment they're drawn towards. Make an effort to push yourself to new types of entertainment. If you usually go for light-hearted sitcoms, try watching a drama series. If you love documentaries and true crime shows, watch some fiction."
          ],
          "notes": []
        },
        {
          "id": 2,
          "locked": true,
          "completed": false,
          "label": "Daily Practice",
          "description": [
            "Create something small every day. Creativity is like any other skill. You get better with practice. If you want to increase your capacity for creative thoughts, work on creating something small every day. You can doodle, sketch, do some light painting, free write, or write down some spur of the moment poetry.",
            "You do not necessarily have to create with an end in mind. In fact, this may inhibit creative thought. Instead of focusing on an overarching project, simply schedule some time every day to let your creativity flow freely.",
            "Make time to be creative. Just as you make time to brush your teeth each night, strive to schedule time for creative pursuits each day. For example, you can plan to do a 20-minute free write every day before bed."
          ],
          "notes": []
        },
        {
          "id": 3,
          "locked": true,
          "completed": false,
          "label": "Walk",
          "description": [
            "Studies indicate that walking actually improves creative thought. Many people feel they get their best thinking done when they're going for walks. Try to schedule a 20 to 30-minute walk each day. This can lead to greater creativity.",
            "It does not matter where you walk. Studies indicate you can walk inside or outside and still get the same peak in creative thought patterns. If it's a rainy day, you can walk through the hallways at work to encourage creative thoughts.",
            "Walking can also help lessen anxiety. If your mind is less muddled by anxious thoughts, you may have more room to be creative."
          ],
          "notes": []
        },
        {
          "id": 4,
          "locked": true,
          "completed": false,
          "label": "Figure out your peak hours",
          "description": [
            "Many people feel more energetic or creative at certain hours of the day. For example, you may feel compelled to write poetry when you first get up in the morning. Or, you may suddenly feel the urge to paint at 10 o'clock at night. Pay attention to your thought patterns and energy levels throughout the day to figure out your peak hours.",
            "Pay attention to both thoughts and emotions. Many people feel more creative when they feel connected with their emotions. If you tend to get sentimental towards the evening hours, you may have a higher capacity for creativity at this time.",
            "It may not be reasonable to work during your peak hours. For example, if you have a 9 to 5 job, you can't stay up until 2 AM writing each night. However, there may be ways to stimulate the environment of your peak hours. If you're a night owl by nature, changing into your pajamas and dimming the lights may help, for example."
          ],
          "notes": []
        },
        {
          "id": 5,
          "locked": true,
          "completed": false,
          "label": "Keep a journal",
          "description": [
            "Regular journaling can be a great way to increase creative thoughts. Writing down your thoughts on a daily basis can help you become more introspective and observant, both of which can bolster creative thought.",
            "Many people find dream journals are great creative tools. As the mind is uninhibited in dreams, you can find a lot of great ideas in your sleep. Try keeping a journal by your nightstand and jotting down your dreams as soon as you get up in the morning.",
            "You can also carry a journal with you. This can allow you to write down thoughts as they come and may encourage you to be more observant. You'll end up seeking inspiration everywhere if you always have a notebook on-hand to record your most interesting thoughts and insights as they come."
          ],
          "notes": []
        },
        {
          "id": 6,
          "locked": true,
          "completed": false,
          "label": "Seek out inspiration",
          "description": [
            "Surround yourself with inspiring material. If you want to be more creative, you should expose yourself to work that inspires you. Read a book of poetry recommended by a friend. Watch a critically acclaimed series. Go see a show at your local theater. All of these things will encourage you to think more creatively."
          ],
          "notes": []
        },
        {
          "id": 7,
          "locked": true,
          "completed": false,
          "label": "Change your mindset",
          "description": [
            "Abandon judgment. Judgement can inhibit creative thinking. When problem-solving, allow your brain to think of new, somewhat crazy ideas. Avoid judging these ideas too out there or absurd. Allowing yourself to think outside the box, without external judgment, is important to creative thinking.",
            "Be open to new things. Creative thoughts can come from a variety of places. If you open yourself up to changes in your routine, you're more likely to stumble upon inspiration. Instead of feeling anxious about exploring new ideas or experiences, see them as exciting opportunities to bolster your creativity.",
            "Take risks. Risk-taking is vital to developing creative thinking. If you're processing new, somewhat scary experiences on a regular basis, you will have to do some creative thinking to find unconventional solutions to new problems and setbacks. Taking risks regularly can make you more resourceful and creative overall.",
            "Do not think in terms of talent. Talent forces people into a black and white thinking pattern. You may find yourself thinking you're either talented or you're not. However, while innate talent can help with creativity, it all comes down to practice. Just make time to be creative every day and your capacity for creative thinking will improve."
          ],
          "notes": []
        },
        {
          "id": 8,
          "locked": true,
          "completed": false,
          "label": "Seek outside help",
          "description": [
            "Socialize regularly. Being around a variety of different people can bolster creative thought. By exposing yourself to people of many different viewpoints and backgrounds, you'll find yourself thinking more creatively. Creative thinkers generally have a large, open-minded perspective.",
            "Reach out to likeminded people. Try to network with other creative people. Surrounding yourself with creative people can make you more creative yourself. Try to reach out to likeminded people to bolster creative thought.",
            "Ask for feedback. Many famous creative thinkers had mentors who looked over their work. If you're stuck on a project, ask another creative person to help. This can be a friend, a peer, or a co-worker. Having someone else provide feedback can help you see your work from an outside perspective, giving you the opportunity to improve."
          ],
          "notes": []
        }
      ],
      "reference": "https://www.wikihow.com/Improve-Creative-Thinking"
    },
    {
      "my_resolutions": false,
      "icon": "/icons/sleepBetterIcon.png",
      "backdrop": "/backdrops/sleepBetterBackdrop.jpg",
      "image_ref": "sleepBetter",
      "type": "lifestyle",
      "color": "navy",
      "title": "Sleep Better",
      "overview": "Getting a good night's sleep is one of the most important things you can do for your overall health and well-being. If you are having trouble sleeping, you're probably getting all kinds of different advice for how to fix the problem. Don't worry! We performed the research for you and assembled all the most reliable tips for better sleep, including recommendations from experts at the National Sleep Foundation and Harvard Medical School.",
      "steps": [
        {
          "id": 1,
          "locked": true,
          "completed": false,
          "label": "Quick changes to fall asleep",
          "description": [
            "Relax in a nice warm bath or shower in the evening. As well as relaxing you, afterwards your body will cool down, which helps you sleep better. Putting on lotion after will help your skin be moisturized and warm.",
            "Take 400mg of a magnesium supplement 30 to 45 minutes before bed. Magnesium helps with insomnia by decreasing the amount of time it takes to fall asleep. It can also increase the quality and length that you sleep.",
            "Sleep naked. According to sleep specialists at the Cleveland Sleep Clinic, sleeping in the nude helps you regulate your temperature.[3] Get a comfortable temperature using blankets or duvet (of suitable warmth), sheets, and pillows. It is usually best to be slightly on the cool side.",
            "Sleep in varying positions. Changing your sleeping position can make a huge difference in the quality of your sleep. Avoid sleeping on your stomach. It's difficult to maintain the proper position, and it is more likely to cause aches and pains. If you wish to sleep on your stomach, put your pillow under your hips instead of under your head.",
            "Use a suitable pillow. If it's too thin, your head will tilt backwards, which is uncomfortable. Likewise, don't stack your pillows so that your head is propped at an angle.",
            "Reduce your light exposure an hour or two before going to bed. Bright light before bedtime can disrupt your body's internal clock. It's one of the primary clues to the body that it's either sleep time, or waking time.",
            "Add gentle sounds. Use a white noise generator that generates various soothing sounds—surf, wind, steam—these are sounds that have no shape, and they can help your brain to de-focus on right now."
          ],
          "notes": []
        },
        {
          "id": 2,
          "locked": true,
          "completed": false,
          "label": "Moderate your Diet",
          "description": [
            "Eat dinner at least three hours before bedtime. A full stomach may disrupt your sleep, and, the heavier the meal, the longer it takes for your stomach to settle down. Avoid greasy foods, as not only are they not good for you but tend to inhibit sleep. Avoid spicy foods. Some people thrive on heavily spiced foods, but if you find your aunt's curry gives you a stomach-ache at night, seriously reconsider your dinner plans.",
            "Avoid going to bed on an empty stomach. A completely empty stomach may interfere with your sleeping patterns just as much as going to bed with a full stomach. If you find that your stomach is grumbling for food and is keeping you awake, eat a light snack about an hour before bedtime. Avoid foods high in carbohydrates or sugar.",
            "Avoid caffeine in the afternoon and evening. This includes coffee, black teas, cocoa, and caffeinated soda. Caffeine can keep you awake even if you drank it earlier in the day, as its effects can last up to 12 hours. This also includes other stimulants like those found in energy drinks even if they are not caffeine. Avoid tobacco or other nicotine products in the evenings as well.",
            "Drink a relaxing warm beverage. Highly recommended beverages include a warm glass of milk or chamomile tea. Most herbal teas are fine, as long as they do not contain any caffeine. Avoid drinking more than a few ounces of fluid directly before bedtime.",
            "Avoid drinking water or other fluids within 1 ½ to 2 hours of your appointed bedtime. Ensure, though, that you drink at least two liters of water during the day. A well-hydrated body will not wake you from thirst, but drinking a big glass of water just before bed might wake you to go to the bathroom at an inconvenient hour.",
            "Avoid alcohol before bed. Alcohol will make you feel sleepy, but it will also reduce the quality of your sleep as your body processes the alcohol and sugars. Alcohol tends to produce broken, shallow sleep (even if you don't notice the periods of waking during the night), which does not refresh."
          ],
          "notes": []
        },
        {
          "id": 3,
          "locked": true,
          "completed": false,
          "label": "Make Your Bed and Bedroom Welcoming",
          "description": [
            "Use your bedroom for bedtime. If your body is used to doing all sorts of things in the room besides sleep it may not make a smooth transition to sleep when it is time. Your mind should associate your bedroom with sleep and perhaps soothing, relaxing activities.",
            "Make your bedroom a haven. The more comfortable your bed and bedroom are, the more conducive they are to a restful sleep. Keep your room completely dark while you sleep so you aren’t kept awake.",
            "Clean your room. Get rid of the cobwebs, dust the shelves, vacuum the floor. Empty the wastepaper basket. Remove dirty plates, cups, and water-bottles. A clean room sets the emotional stage for your room being a safe, healthy place, not a neglected dumping-ground to wallow in. Also, regular cleaning can alleviate allergies which can disrupt sleep. It also keeps pests like mice, rats, and cockroaches from invading your space.",
            "Beautify your room. An aesthetically pleasing room will make you happier than one that's displeasing. You do not necessarily have to have your room be a page from the Ikea catalog. But simple changes, such as getting rid of an ugly bedspread or repainting your walls can subtly shift your mood.",
            "Maintain your mattress. Replace it after five to seven years of regular use. If you feel springs or ridges beneath the surface when you're lying on the bed, or you and your partner tend to roll over each other a lot at night (unintentionally), it's time to go mattress shopping!"
          ],
          "notes": []
        },
        {
          "id": 4,
          "locked": true,
          "completed": false,
          "label": "Change Your Daily Routine",
          "description": [
            "Go to bed and get up at the same time every day. Varying your sleeping times by more than an hour can severely disrupt your sleep quality by breaking your circadian rhythm. Use the same sleep schedule even at weekends. Even if you have to go to bed later occasionally, still get up at your normal time. When your alarm clock goes off, get up right away every day. Don't lie in or snooze.",
            "Consider allowing less time for sleeping. Different people need different amounts of sleep. If you take longer than 30 minutes to fall asleep, or often wake up for long periods during the night, you may be allowing too much time for sleep. You need deep, continuous sleep, even if it's shorter, rather than shallow broken-up sleep.",
            "Develop a sleep routine. Try doing the same steps each night before you go to bed, to ready yourself for sleep. Put on some ambient music, and instead of incandescent lights, light several candles in your living room and in your bedroom. Practice breathing exercises (see below) or meditation, focusing on relaxing your body. When it's time, extinguish the candles as you make your way to the bedroom. Your home will get progressively darker until the last candle is extinguished.",
            "Try deep breathing relaxation before bed. Find a comfortable position. Make sure your environment is relaxed. Not much light, calm music and a space where you know you will not be interrupted are ideal. Clear your mind. Close your eyes and imagine all those problems that you keep in your mind everyday fading out with each breath. Pull in the positive. Inhale positive images that makes you happy. While you do this keep, smile.",
            "Focus on your breath. Feel the oxygen within your body. You should start feeling a relaxing sensation across your body and mind. Try to maintain this for 10 minutes every night before going to sleep. You could even add a few drops of lavender oil onto your pillow, which calms the nerves and helps you sleep.",
            "Exercise regularly. If you have a sedentary job, a lack of physical exertion may contribute to reducing the quality of your sleep. The human body uses sleep to repair and recover. If there isn't much from which to recover, your body's sleep cycle could be disrupted. Don't exercise less than 2 hours before bedtime. Exercise can greatly enhance and promote sleep. However, your body will be \"revved up\" some time after your workout.",
            "Consider taking a nap. For some people (depending on work and your daily routine), a short rest in the afternoon can help alleviate drowsiness experienced during the day. Though naps are not for everyone - many people feel even drowsier after a nap."
          ],
          "notes": []
        },
        {
          "id": 5,
          "locked": true,
          "completed": false,
          "label": "Use Medication",
          "description": [
            "Consult with your doctor before taking medication. Try melatonin. Melatonin is a hormone produced by the pineal gland in your brain. The pineal actively converts serotonin to melatonin when it is dark, but when light is present it does not do so, and the melatonin oxidizes back into serotonin.",
            "Try plain antihistamine products that cause drowsiness. These are safe when taken without extra ingredients — i.e. no pain relievers, decongestant, expectorant, etc., but only for a night or two, as tolerance to them quickly builds.",
            "Tell your doctor if you are concerned that you might have a sleep disorder. Some of the most common sleep disorders are insomnia, narcolepsy and parasomnias. If you are indeed suffering from and are diagnosed with any of these conditions, your doctor will recommend treatment accordingly."
          ],
          "notes": []
        }
      ],
      "reference": "https://www.wikihow.com/Sleep-Better"
    },
    {
      "my_resolutions": false,
      "icon": "/icons/overcomeAddictionIcon.png",
      "backdrop": "/backdrops/overcomeAddictionBackdrop.jpg",
      "image_ref": "overcomeAddiction",
      "type": "quitting",
      "color": "red",
      "title": "Overcome Addiction",
      "overview": "There’s a myth out there that addiction is inescapable or something that’s locked-in for life, but that’s definitely not the case. In fact, more people succeed at overcoming their addiction than fail. Acknowledging that you’re addicted to something and wanting to change are the first steps, so you’re on the right track! This article will show you how to come up with a plan for overcoming your addiction and stick with it, even when things get tough.",
      "steps": [
        {
          "id": 1,
          "locked": true,
          "completed": false,
          "label": "The Decision",
          "description": [
            "Write down the harmful effects of your addiction. It might not feel good to acknowledge all the ways in which your addiction is harming you, but seeing the list on paper will help you resolve to stop as soon as possible. Take out a pen and a piece of paper and brainstorm a list that includes all the negative effects you've experienced since your addiction started.",
            "Make a list of positive changes you want in your life. Now that you've detailed all the negative effects of your addiction, think about how much your life will improve once you've kicked the habit. Create a picture of your life post-addiction. How do you want it to look?",
            "Write down your quitting commitment. Having a list of solid reasons to quit will help you stick to your plan in the long run. Your reasons for quitting must be more important to you than continuing your addictive behavior. This mental hurdle is tough, but it's a necessary first step to quitting any addiction. No one can make you quit but yourself. Write down the true, solid reasons you're stopping this habit. Only you know what they are."
          ],
          "notes": []
        },
        {
          "id": 2,
          "locked": true,
          "completed": false,
          "label": "Make a plan",
          "description": [
            "Set a date to quit. Don't set it for tomorrow, unless you're pretty sure quitting cold turkey will work for you. Don't set it for more than a month from now, because you might lose your resolve by then. Aim for a date in the next couple of weeks. This will give you enough time to become mentally and physically prepared.",
            "Seek personal and professional support. It might not seem like it now, but you're going to need all the support you can get during your journey to overcome addiction. Because so many people battle addictions, there are many wonderful institutions in place that serve as support systems, helping you stay motivated, providing tips for success, and encouraging you to try again if you have a false start.",
            "Identify your triggers. Everyone has a certain set of triggers that make them automatically want to indulge their habits. For example, if you're struggling with an alcohol addiction, you might find it difficult to attend a certain restaurant without feeling a strong urge to drink. If you're addicted to gambling, passing a casino on the way home from work might make you feel compelled to stop. Knowing your triggers will help you face them down when the time comes to quit.",
            "Start ramping down your addictive habit. Instead of quitting immediately, start by decreasing your use. For most people, this makes it easier to quit. Indulge less frequently, and gradually continue reducing it as your day to quit for good approaches.",
            "Get your environment ready. Remove reminders of your addiction from your home, car, and workplace. Get rid of all the objects that go along with the habit, as well as other items that remind you of the habit."
          ],
          "notes": []
        },
        {
          "id": 3,
          "locked": true,
          "completed": false,
          "label": "Follow through and Handle Withdrawal",
          "description": [
            "Stop the addictive behavior as planned. When the big day arrives, keep your promise to yourself and quit. Those first few days are going to be hard. Keep yourself busy and stay positive. You're on your way to an addiction-free life.",
            "Fill your time. If you need distractions, try exercising, taking up a new hobby, cooking, or hanging out with friends. Joining a new club, sports team, or another kind of community group will help you make new friends and start a new chapter of your life in which addiction is not a part of. Positive social interactions can stimulate the release of neurochemicals which elicit feelings of happiness and satisfaction without the need for drugs.",
            "Keep clear of your triggers. Stay away from the people, places, and things that make you want to go back to your old habits. You might need to construct a completely new routine for a while until the edge wears off a bit.",
            "Don't give in to rationalizations. The physical and mental pain of addiction withdrawal is real, and you'll likely start telling yourself it's okay to take up the habit again. Don't listen to the voice telling you to start back up and don't give up on yourself when it feels hard. Every bit of pain will be worth it in the end.",
            "Don't let a relapse be the end of your journey. Everyone slips up from time to time. That doesn't mean you should give in and return to your addictive habits in a full-blown relapse. If you have a slip-up, go back over what happened and determine what changes you can make if it happens again. Then get back on your feet and start again.",
            "Celebrate your accomplishments. Do something nice for yourself when you meet the goals you've made, no matter how small. Kicking an addiction is incredibly tough work, and you deserve to be rewarded."
          ],
          "notes": []
        }
      ],
      "reference": "https://www.wikihow.com/Overcome-an-Addiction"
    },
    {
      "my_resolutions": false,
      "icon": "/icons/improveSocialSkillsIcon.png",
      "backdrop": "/backdrops/improveSocialSkillsBackdrop.jpg",
      "image_ref": "improveSocialSkills",
      "type": "social",
      "color": "orange",
      "title": "Improve Social Skills",
      "overview": "Good social skills are an important part of building rich friendships, enjoying yourself in public, and succeeding in your career. If you consider yourself an introvert, it can be hard to engage in conversation with people you don’t know. Luckily, the more you practice being social, the easier it will become.",
      "steps": [
        {
          "id": 1,
          "locked": true,
          "completed": false,
          "label": "Enhance Verbal Communication",
          "description": [
            "Be aware of the volume and tone of your voice. Don’t speak too softly or too loudly either. Speak at a volume that can be heard easily, and suggests confidence but never shows aggression. Remember to adjust the volume of your voice to suit the surrounding environment.",
            "If possible, speak at the same volume and tone as people in your immediate environment. If you find that you speak quickly because you're nervous or anxious, try speaking at about a third of your normal speed. This trick is called slow talk, and it not only helps you speak clearly, it can also help you feel calmer.",
            "Learn the right manner in which to initiate a conversation. You can begin by saying something that is generally or universally true, rather than overly personal because that might seem to be insulting or offensive to some. Comment on the weather, or maybe some current event you heard about in the news recently. You could compliment someone on what they are wearing or the way they have done their hair.",
            "Find ways to extend conversations. After speaking about general issues such as current events, try bringing up more intimate or a more relatable topic. Asking questions that delve a little deeper below the surface. For example, asking polite questions about their family, employment, or hobbies can lengthen a conversation and make it more meaningful. Remember that a conversation takes two people, so avoid speaking too little or vice versa. Try as much as possible to ask open-ended questions.",
            "Steer clear of inflammatory topics. When interacting with a person you don't know all too well, there are some subjects you should steer clear of. In general, these would include controversial subjects like religion, politics, or the persons ethnicity/race etc.",
            "End conversations courteously. Instead of abruptly cutting them off and walking away, try to be polite about it. Tell them in a sweet, non-offensive way that that you have to take their leave, and give them the impression that you enjoyed the interaction."
          ],
          "notes": []
        },
        {
          "id": 2,
          "locked": true,
          "completed": false,
          "label": "Enhance Non-Verbal Communication 1",
          "description": [
            "Pay attention to your body language. Our gestures often communicate messages more powerfully than words. Remember that body language plays an important role in social interactions. Be wary and take time to reflect on messages you give others through your posture, eye contact, and facial expressions.",
            "If you are avoiding eye contact, standing far away, or crossing your arms, you are likely telling others that you don't want to interact. Adopt a confident pose, and smile a bit more, Make frequent eye contact with people you are talking to; stand tall and unfold your arms. This way you are certainly more likely to create a good impression on people you speak to.",
            "Observe how other people behave in social situations. Watch their body language closely and consider why they are better at interacting with others socially. Observe their posture, their gestures, their facial expressions, and how often they make eye contact. Consider how you might replicate or improve upon your own body language while talking to people.",
            "Determine 'how well' the people you're observing know each other. This is important because the body language shared among close friends who are talking differs completely from that displayed by two complete strangers even in an ordinary setting.",
            "Mentally take notes about what you see and observe. This will both guide and help you to become more aware of your own body language. Try not to focus too much on yourself and making adjustments in the moments, though. Focus on the people with whom you're interacting and practice new skills with yourself or a close friend later.",
            "Focus on a keeping a genuine smile right from the moment you meet a person. A smile is universally known to be a great way to show you are open to others, and makes people feel at ease. Just focusing on smiling when you meet people will make things a little easier."
          ],
          "notes": []
        },
        {
          "id": 3,
          "locked": true,
          "completed": false,
          "label": "Enhance Non-Verbal Communication 2",
          "description": [
            "Improve your non-verbal communication skills at home. Home is often the best place to start learning something new because you won't be as inhibited in a familiar setting. You could try making a video of yourself in conversation with your family members, and then consider how you can improve your body language. Enlist the help of family members or even close friends as they can give you honest useful feedback that no one else would. Some other tips include 'pulling back' your shoulders, keeping your spine straight, and your chin up, parallel to the floor.",
            "You could also practice non-verbal gesturing in front of a mirror. One of the best things about practicing at home is that it's obviously a private and a low-pressure environment. Don't be shy! It just you and the mirror! Have fun trying out different types of body language signs and gestures.",
            "Practice your eye contact. Work on making more eye contact as you get comfortable with it. Don't stare people in the eye, especially if you're uncomfortable with it because that could prove annoying. Whenever you think about eye contact, make yourself look at someone in the eye for just about 3-5 seconds only. As this gets easier, you'll be natural about it.",
            "If you're not right next to someone, look at their earlobe, or the spot right between their eyes. This is faking it, but people won't be able to tell the difference. If you're nervous making eye contact, some social psychologists suggest that you practice doing with people on TV. Put on the news and try keeping eye contact with the anchor.",
            "Spend a little extra time on your self while getting ready to go out. You'll feel more confident with the way you look. Spending a little extra time on making sure you like the way you look and feel confident about yourself will make all other social situations easier to be in. Develop a hygiene routine, buy some new clothes or a pair of shoes you liked, and dressing your best not only improve self-confidence they make you naturally more social, too."
          ],
          "notes": []
        },
        {
          "id": 4,
          "locked": true,
          "completed": false,
          "label": "Practice in the Real World",
          "description": [
            "Find a place where people seem easy going. Starting a conversation with an unknown person will seem less risky and more acceptable to everyone there. Some situations seem easier than others, especially when initiating social interaction. Supermarkets or banks are more often than not among the worst places to initiate a conversation with a total stranger (people just want to get their groceries and be done with it). Coffee shops, sporting events, and community centers can be great places to start talking to great new people.",
            "To meet new people, try joining a group such as an amateur sports club or a book club. A fitness class is often a great place to start a conversation. You can also look for groups online to find meetings of people interested in the same things as you. Websites like MeetUp.com are great for that.",
            "Start small, chatting with service people that helped you out to get started. Ask your barista how their day is going. Thank the mailman as he passes by, or ask a co-worker how their weekend went. You don't have to dive into deep, invasive, and consuming conversations immediately. Start small. Remember, there is no downside to saying 'hey' to someone. You will most likely not see them again, and these low-key conversations are the best to practice with.",
            "Pick someone who doesn’t appear busy or uninterested. Approach your subject with open body language and appear to be interested in getting to know them better. This often is a good opportunity to have a meaningful conversation.",
            "Be confident when approaching a person. If you are too nervous you may make the other person nervous too! Remember to put away your cell phone. Checking your phone all the time during a conversation annoys people, and makes them think you're more interested in your phone than you are in talking to them!"
          ],
          "notes": []
        },
        {
          "id": 5,
          "locked": true,
          "completed": false,
          "label": "Further improve Socializing in the Real World",
          "description": [
            "Reflect on how it went. If the encounter went on well, take note what you did right and do try to repeat this in the future. If things went poorly, mentally assess the situation to determine what exactly you did that wasn't all that impressive.",
            "Did you approach someone who appeared to be busy with something or who was displaying closed body language? Was your own body language open and inviting? Did you start the conversation with an appropriate topic?",
            "Talk to more people. Your social skills will improve with practice. The more you communicate and interact with people, you will get better at it. Try not to let negative social interactions get you down. Oftentimes such encounters are not your fault. Remember that there will often be setbacks as you work toward improvement. Learn from the situation, and go forward armed with new knowledge.",
            "Join a support group. This is usually a safe, comfortable environment where learning to speak to people can be easier. You are not the only one there who wants to work on their speaking skills. Why not practice with others who are in the same boat? The very fact that you want to improve your social skills shows that you are an open, kind person who is willing to work on themselves. Surround yourself with people with similar goals to help you grow.",
            "If you suspect social anxiety is interfering with your everyday life, seek help from a certified therapist who specializes in Social Anxiety Disorder."
          ],
          "notes": []
        }
      ],
      "reference": "https://www.wikihow.com/Improve-Social-Skills"
    },
    {
      "my_resolutions": false,
      "icon": "/icons/improveQuickLearningIcon.png",
      "backdrop": "/backdrops/improveQuickLearningBackdrop.jpg",
      "image_ref": "improveQuickLearning",
      "type": "intellectual",
      "color": "purple",
      "title": "Improve Quick Learning",
      "overview": "Everyone engages in learning each day, but are you learning at your maximum potential? It is worth putting forth the effort to improve. You can enhance your learning speed by mastering memory techniques and challenging your mind.",
      "steps": [
        {
          "id": 1,
          "locked": true,
          "completed": false,
          "label": "Compress and Visualize Knowledge 1",
          "description": [
            "Identify your learning style. By determining your learning style, you can determine the best techniques to help you retain information more effectively. Many people have multiple learning styles while some people may just have one dominant style. Figure out which style works best for you. Auditory learners pick up information by listening to it. Lectures, podcasts, discussion groups, and videos may work best for you.",
            "Visual learners gain new information by watching it. Charts, diagrams, pictures, films, and written material is most beneficial for these types. Kinesthetic learners adopt new practices by doing them. Participation in an activity, such as a science lab, discussion group, or hands-on class, may help you learn more effectively.",
            "Use mnemonic devices. These are quick tricks designed to increase the amount of information that your brain can remember. They work by getting you to organize information into memorable patterns. The song 'I can sing a rainbow' is one example; it is used to remember color names.",
            "Study with images. Transform written information or numbers lists into visuals, such as a chart, graph, or map. Creating images like these increases your mind's flexibility which, in turn, helps with its ability to remember new information. Don't worry if the final product isn't perfect; assigning images is a very individual thing.",
            "Engage your senses. If you need notes, take them by hand and via audio recorder. Then, type them up afterwards. The more ways that you experience something, the better you learn it. Use as many of your senses as you can, perhaps by playing a song as you study."
          ],
          "notes": []
        },
        {
          "id": 2,
          "locked": true,
          "completed": false,
          "label": "Compress and Visualize Knowledge 2",
          "description": [
            "Make connections. You come to every task with tons of prior knowledge; use it. Ask yourself where you have seen this particular type of information before. For example, if you are writing an essay, remember what worked the last time you turned something in.",
            "Connect dates that you are trying to learn with important ones in your memory. It can be your school team winning, your mother's birthday, father's birthday, or any date that is significant to you. You can even break up the dates and remember months based on Zodiac signs.",
            "Emphasize recall. Push your mind to remember every detail in the moment and to make the larger connections later as you talk with others about your experience. Watch a lab demonstration and then discuss your observations with your lab partner afterwards. Pay attention to what your partner noticed that you missed and vice versa.",
            "Tell a story. Benefit from the power of an interesting tale. There is a reason why creation stories are remembered and passed from generation to generation. They excite while also passing along knowledge.",
            "If you are working with a group, build a story together. For example, if you are studying the history of U.S. presidents, make up a story about each one. Or, better yet, find a real story to remember.",
            "Create a mindmap. A mindmap is a visual chart that uses branches and lines to demonstrate the relationship between ideas. These are great for visual learners. Write the main idea in a box in the center of a piece of a paper, and draw branches off the center to identify similar ideas. Keep drawing out branches to new sources of information, and connect ideas with lines or images."
          ],
          "notes": []
        },
        {
          "id": 3,
          "locked": true,
          "completed": false,
          "label": "Challenge your Mind",
          "description": [
            "Be aware of your strengths. Set aside a few minutes every day to think about how you learn. Ask yourself, 'Do I understand more with notes or highlighting?' Write down a list of what you consider to be your strengths and weaknesses when learning something new. For example, do you quit easily when you are frustrated?",
            "Test yourself. Don't wait until the formal exam date to see how you perform under pressure. Set up rounds of practice testing well beforehand. Give yourself a prep exam or ask a friend to give you a pop quiz. If you use flashcards, do not remove cards as you feel comfortable with them. It is best to keep all cards in play and to practice frequently until the date of an exam.",
            "Keep it different and new. Brains can get lazy, especially when they are good at certain tasks. Once you reach mastery at a certain task, you need to move on to a new one. For example, if you can easily play poker, push yourself to learn blackjack. You want your mind to be constantly challenged.",
            "Seek out difficulty. Set a high bar for new learning tasks. Try to make a difficult recipe or change your own oil. Keep it challenging, but not impossible. This will help you to remember how to learn quickly by improving how your mind performs under stress.",
            "Check your motivation. Before you start a task, ask yourself, “Why am I doing this?” The more passionate that you are about a task, the better. Your excitement will let your brain know that it is time to learn.",
            "Stay single-minded. Focus all of your attention on one task before moving on to another. Finish your game of chess before moving on to checkers. If you switch actions mid-stream you lose valuable time. You also have to get your mind 'back in the game' every time you switch jobs. The exception is if you are completely stuck on a task. If so, leave that math problem behind and work on writing for a bit before coming back to it."
          ],
          "notes": []
        },
        {
          "id": 4,
          "locked": true,
          "completed": false,
          "label": "Prepare your Mind",
          "description": [
            "Practice yoga meditation. Find a quiet place and do a few stretches before a big test. Or, take five deep, calming breaths before walking in to the boardroom. You want to achieve a relaxed and focused mind. This is especially helpful prior to completing a particularly difficult or time-intensive task. Watching your breathing, along with other yoga techniques, improves both long and short term memory.",
            "Stay fit. Try to work out at least 30 minutes three times a week. Strength training, intervals, and cardio all improve brain function. Exercise also boosts productivity and energy levels, leading to more production in the long term. Students have been shown to work faster on a memory task after exercising. It is believed that these benefits are immediate.",
            "Eat right. Get three balanced meals a day, even you are faced with little time. Quality food is fuel for your mind. For example, cinnamon not only improves memory, it reverses the damage associated with memory loss.[18] Likewise, eating dark chocolate leads to a better memory. Polyunsaturated fatty acids (especially omega-3), found in salmon and walnuts, help with memory as well. Forgetfulness is often a sign of omega-3 deficiency.",
            "Drink water. Carry a water bottle with you to stay hydrated and refill it often. If you are even a little dehydrated, your mind will move slower. Drinking water well in advance, and immediately before, a test has shown the best results. Children offered additional drinking water perform better on tests involving memory, such as pairing letters.",
            "Get enough sleep. Aim for 8-10 hours of undisturbed sleep a night. Sleep allows your mind and body to rest in preparation for a new day. It also helps to approach a complex task from a new perspective the following day."
          ],
          "notes": []
        }
      ],
      "reference": "https://www.wikihow.com/Improve-Your-Ability-to-Learn-Quickly"
    },
    {
      "my_resolutions": false,
      "icon": "/icons/becomeVeganIcon.png",
      "backdrop": "/backdrops/becomeVeganBackdrop.jpg",
      "image_ref": "becomeVegan",
      "type": "lifestyle",
      "color": "navy",
      "title": "Become Vegan",
      "overview": "With a positive attitude, a desire to make a change in a healthy direction, and some diligence in grocery aisles, it is possible to discover a whole new world and reap a multitude of physical, mental and emotional benefits (not to mention financial savings!) by turning to Veganism.",
      "steps": [
        {
          "id": 1,
          "locked": true,
          "completed": false,
          "label": "Plan it out",
          "description": [
            "Just because a vegan diet is low in calories and fats (and completely cholesterol free), that doesn't mean it's healthy. Most vegan things will be better for you than otherwise. The Academy of Nutrition and Dietetics says a vegan diet is only healthy when it's well-rounded and planned out. If you're considering going vegan for health reasons, you might also want to consider buying organic. If it's not, you're missing out on vitamins and nutrients that your body needs to function. So do yourself a favor and do it right.",
            "Do your homework. What foods that you like (that are vegan-friendly) do you need to start putting in your diet? Nuts? Quinoa? Beans? Be sure to consider whether or not you think it is important to cut out honey, gelatin, etc. As well as if you want to be a 'full vegan' or just a dietary vegan. There are animal fats in soaps, there may be leather or the like in your shoes and clothes, etc. Does animal testing bother you? Some products and foods are tested on animals and that can also be something to avoid.",
            "Get online. There are tons of websites catered to budding vegans that are full of recipes, quizzes, fun facts, and interactive tools to get you on board. They'll even do a week's worth of recipes for you! Utilize what you have at your disposal to ensure you're partaking in a balanced diet."
          ],
          "notes": []
        },
        {
          "id": 2,
          "locked": true,
          "completed": false,
          "label": "Get a physical",
          "description": [
            "Get a physical. Visit your doctor and make sure you are in decent physical shape. Tell your doctor your plans to become a vegan and ask if there are any considerations to take into account given your medical history. For example, those with anemia need to be particularly attentive to get enough iron in their vegan diet. Some doctors aren't well educated in veganism and mistakenly believe it is unhealthy or that you can't get enough protein or calcium.",
            "Calcium-fortified plant milks and orange juices are an excellent substitute for dairy products as a source of calcium. Ask your doctor how to maintain a balanced diet with your new eating habits. They'll be able to shed some light on how to obtain the necessary vitamins and minerals you need to function on top of your game."
          ],
          "notes": []
        },
        {
          "id": 3,
          "locked": true,
          "completed": false,
          "label": "Write it down",
          "description": [
            "Be clear about why you're becoming a vegan. This is a huge change in your lifestyle, not to be taken lightly as a trend. Having your reasons lined out will not only ensure that you don't waste your time and efforts doing something you're not really passionate about, but it'll also help you stick with it. And answer questions when people raise an eyebrow at your dining choices!",
            "If there's a particular essay, picture, or quote that reinforces your desire to become a vegan, print it out and put it in a place where you'll see it often, like your refrigerator.",
            "In case anyone asks, the vegan diet is appropriate for all lifestyles (as long as it's done well). Athletes, pregnant women, children, and seniors all can benefit from a healthy vegan diet. No need to defend yourself when the in-laws start the inquisition. You've got science."
          ],
          "notes": []
        },
        {
          "id": 4,
          "locked": true,
          "completed": false,
          "label": "Form the habits",
          "description": [
            "Ease into it. Make a plan to give up one kind of non-vegan food per week. Not only will this make for an easier lifestyle adjustment, but it will also help your body make the transition as smoothly as possible. Any sudden, drastic change in your diet would likely wreak havoc on your body, especially if you go from being an omnivore to being a vegan.",
            "Know the difference between live foods and life-less products consumed as food. It's much trickier for vegans than for vegetarians. You already know that you can't eat cheese because cows are exploited in order to generate the milk to make cheese, but did you know that even most cheese alternatives contain casein, a milk protein? Do your homework and read ingredient labels to prevent accidental consumption of non-vegan food.",
            "Make time to cook. Most prepared foods are going to be off-limits, so whether you like it or not, you're going to have to learn to cook. It'll give you a greater connection with your food, as it can be exciting and very rewarding (your friends and family will dig it, too). Recognize that the taste and experience of your food is just as important as the practicality of implementing it into your lifestyle. Be creative and choose a variety of produce and products to avoid monotony and boredom."
          ],
          "notes": []
        },
        {
          "id": 5,
          "locked": true,
          "completed": false,
          "label": "Stay on track",
          "description": [
            "Maintain balance. If you find yourself constantly fatigued or groggy, you may be missing something imperative to your diet. It can get pretty easy to eat the same things day in and day out, but with a vegan diet, that's not kosher. Make sure you're getting enough protein, calcium, iron, vitamin everything...the list could go on, but it would exceed your bandwidth usage.",
            "Reward yourself. After learning how to cope with the extreme makeover in your kitchen, your budget, your past time, your health, and your appearance, make it a point to treat yourself to a new wardrobe, a vacation, or a new kitchen. You've earned it!",
            "Share your delight. There is nothing more satisfying than being acknowledged for pleasing somebody else's tummy. Treat some family or friends to a gourmet meal that you yourself prepared with all the trimmings. Be a vegan evangelist through positive demonstration (not through nagging) and help others discover how they too can make that transition from eating flesh to savoring fresh, whole foods."
          ],
          "notes": []
        }
      ],
      "reference": "https://www.wikihow.com/Become-a-Vegan"
    },
    {
      "my_resolutions": false,
      "icon": "/icons/saveMoneyIcon.png",
      "backdrop": "/backdrops/saveMoneyBackdrop.jpg",
      "image_ref": "saveMoney",
      "type": "lifestyle",
      "color": "navy",
      "title": "Save Money",
      "overview": "The best way to achieve financial stability is to save money that you have. It is not always possible to control how much money you earn but it is more controllable to save money and that you have earned. With simple habitual changes, you can help your financial status be more stable.",
      "steps": [
        {
          "id": 1,
          "locked": true,
          "completed": false,
          "label": "Be responsible 1",
          "description": [
            "Pay yourself first. The easiest way to save money rather than spending it is to make sure that that you never get a chance to spend the money in the first place. Arranging for a portion of each paycheck to be deposited directly into a savings account or a retirement account takes the stress and tedium out of the process of deciding how much money to save and how much to keep for yourself each month — basically, you save automatically and the money you keep each month is yours to spend as you please.",
            "Avoid accumulating new debt. Some debt is essentially unavoidable. For instance, only the very rich have enough money to buy a house in one lump sum payment, yet millions of people are able to buy houses by taking out loans and slowly paying them back. However, in general, when you can avoid going into debt, do so. Paying a sum of money up-front is always cheaper in the long run than paying off an equivalent loan while interest accumulates over time.",
            "Set reasonable savings goals. It's a lot easier to save if you know you have something to save for. Set yourself savings goals that are within your reach to motivate yourself to make the tough financial decisions needed to save responsibly. For serious goals like buying a house or retiring, your goals may take years or decades to achieve. In these cases, it's important to monitor your progress on a regular basis. Only by stepping back and taking a look at the big picture can you get a sense for how far you've come and how far you have left to go.",
            "Establish a time-frame for your goals. Giving yourself ambitious (but reasonable) time limits for achieving your goals can be a great motivational tool. For example, let's say that you set a goal of being on your way to owning a house two years from today. In this case, you'd need to investigate the average home cost in the area you'd like to live in and start saving for the down payment on your new house (as a general rule, down payments are often required to be no less than 20% of the purchase price of the house).",
            "Keep a budget. It's easy to commit to ambitious savings goals, but if you don't have any way to keep track of your expenses, you'll find that it's difficult to achieve them. To keep your financial progress on-track, try budgeting out your income at the beginning of each month. Assigning a set portion of your income to all of your major expenses ahead of time can help ensure that you don't waste money, especially if you actually divide each paycheck according to your budget as soon as you get it.",
            "Record your expenses. Keeping a tight budget is a must for anyone looking to save money, but if you don't keep track of your expenses, you may find that it's difficult to stick to your goals. Keeping a running tally of how much you've spent on various types of expenses each month can help you identify 'problem' areas and adjust your spending habits to fit your budget. However, keeping track of your expenses can require a serious attention to detail."
          ],
          "notes": []
        },
        {
          "id": 2,
          "locked": true,
          "completed": false,
          "label": "Be responsible 2",
          "description": [
            "Double check all payment amounts. Always ask for the receipt when making a purchase in-person, and always print off a copy of any online purchases that you make. Make sure that you’re not being overcharged or billed for items that you do not want; you'll be amazed how often that happens.",
            "Start saving as early as possible. Money that's squirreled away in savings accounts usually accumulates interest at a set percentage rate. The longer your money remains in the savings account, the more interest you accumulate. Thus, it's in your advantage to start saving as soon as you possibly can.",
            "Consider contributing to a retirement account. During the years when you're young, energetic, and healthy, retirement can seem so far away that it's almost not worth even thinking about. By the time you're older and begin to lose steam, it can be all that you think about.",
            "Make stock market investments cautiously. If you've been saving responsibly and have a little extra money at your disposal, investing in the stock market can be a lucrative (but risky) opportunity to make extra money. But be cautious, the money you invest in the stock market can potentially be lost for good if you don't know what you're doing.",
            "Don't get discouraged. When you're having trouble saving money, it's easy to lose your nerve. Your situation may seem hopeless — it may seem almost impossible to save up the money you need to meet your long-term goals. However, no matter how little you're starting with, it's always possible to begin saving money. The sooner you start, the sooner you can be on your way to financial security."
          ],
          "notes": []
        },
        {
          "id": 3,
          "locked": true,
          "completed": false,
          "label": "Cut expenses 1",
          "description": [
            "Remove luxuries from your budget. If you're having trouble saving money, it's wise to start here. Many of the expenses that we take for granted are far from essential. Eliminating luxury expenses is a great first step to improve your financial situation because this won't impact your quality of life or your ability to perform your work significantly.",
            "Find cheaper housing. For most people, costs related to housing make up the single biggest expense in their budget. Because of this, saving money housing can free up a substantial amount of your income for other important activities, like saving for retirement.",
            "Eat for cheap. Many people spend much more on food than is necessary. While it's easy to forget to be thrifty when you're biting into a gourmet meal at your favorite restaurant, food-related expenses can become quite large if allowed to get out of control. In general, buying in bulk is cheaper in the long run than buying small quantities of food.",
            "Reduce your energy usage. Most people accept the price on their utility bill each month without question. In fact, it's possible to greatly reduce your energy usage (and thus your monthly bill) with just a few simple steps. These tricks are so easy that there's practically no reason to avoid them if you're looking to save money."
          ],
          "notes": []
        },
        {
          "id": 4,
          "locked": true,
          "completed": false,
          "label": "Cut expenses 2",
          "description": [
            "Use cheaper forms of transportation. Owning, maintaining, and running a car can eat up a large portion of your income. Depending on how much you drive, fuel can cost you hundreds of dollars per month. On top of this, your car will also cost you in licensing fees and maintenance expenses. Instead of driving, use a cheap (or free) alternative option instead.",
            "Have fun for cheap (or free). While reducing your personal expenses can mean cutting frivolous luxuries out of your life, you don't necessarily have to stop having fun if you're trying to save money. Changing your leisure habits and recreational activities to more affordable ones allows you to strike the perfect balance between fun and responsibility.",
            "Avoid expensive addictions. Certain bad habits can put a serious damper on your efforts to save money. In worst-case scenarios, these habits can become serious addictions that are almost impossible to defeat without help. Worse yet, many of these addictions can be extremely hazardous to your health in the long term."
          ],
          "notes": []
        },
        {
          "id": 5,
          "locked": true,
          "completed": false,
          "label": "Spend money intelligently",
          "description": [
            "Spend money on absolute essentials first. When it comes to spending money, there are some things that you absolutely, positively cannot do without. These things (namely, food, water, housing, and clothing) are your first priority when it comes to spending your cash.",
            "Save for an emergency fund. If you don't already have an emergency fund with enough money in it so that you can survive if you suddenly lose your income, begin contributing to one immediately. Having a reasonable amount of money stockpiled in a secure savings account gives you the freedom to comfortably sort out your affairs in the event that you lose your job.",
            "Pay off your debt. Left unchecked, debt can seriously derail your efforts to save money. If you're only making the minimum payments on your debt, you'll end up paying much more over the life of the loan than if you had paid it off more quickly.",
            "Put away money next. If you've established an emergency fund and paid off all (or nearly all) of your debt, you'll probably want to start putting your extra money in a savings account. The money you save this way is different from your emergency fund — whereas you'll want to avoid dipping into your emergency fund unless you absolutely have to, your normal savings are available for big, important purchases, like repairs to the car you use to drive to work.",
            "Spend on smart non-essentials. If, after adding a healthy amount of your income to your savings each month, you have extra money left over, you should consider making certain non-essential investments that can improve your productivity, earning potential, and quality of life in the long run.",
            "Spend on luxuries last. Saving money isn't all about living hard and lean. When you've paid off your debt, established an emergency fund, and spent money on smart purchases that pay off in the long term, it's OK to spend a little money on yourself."
          ],
          "notes": []
        }
      ],
      "reference": "https://www.wikihow.com/Save-Money"
    },
    {
      "my_resolutions": false,
      "icon": "/icons/organizeYourLifeIcon.png",
      "backdrop": "/backdrops/organizeYourLifeBackdrop.jpg",
      "image_ref": "organizeYourLife",
      "type": "lifestyle",
      "color": "navy",
      "title": "Organize Your Life",
      "overview": "If you’re suffering from a common affliction of being too busy — you have no time to spare, and no time to unwind. The good news is that there’s a cure: organization! Follow these simple steps below, and you’ll be enjoying regular bouts of relaxation and peace of mind.",
      "steps": [
        {
          "id": 1,
          "locked": true,
          "completed": false,
          "label": "Organize yourself Mentally 1",
          "description": [
            "Determine the cause of your lack of organization. Why do you feel cluttered? For some people, busy schedules get in the way, making organization difficult. For others, simply lack of motivation or know-how is the culprit. To start organizing your life, you need to acknowledge the cause and make a decision to change it.",
            "Consider what needs to be organized. Although it’s easy to say 'everything', chances are there are specific areas in your life that have more clutter than others. Where are you the most disorganized? Your bedroom? At work? Consider your skills in making plans, cleaning house, or running errands. Which of these is the most stressful for you to accomplish? Remember to consider your work life, friendships, and general thought processes as well.",
            "Fill out a calendar. If you have a busy schedule (or even if you don’t!) purchase or make a solid calendar and place it somewhere you will see it on a regular basis.[3] This could be near your keys, on the fridge or in your home office. Take a few minutes to fill out the entire calendar with important dates and events coming up.",
            "Get a good planner. The step up from the calendar is the handheld planner; an ultra organised list of daily activities. Although the thought of a planner may seem silly, it is consistently used by organised people. Whenever you create plans for an event, are assigned a project for work or school, or need to keep track of tasks and errands, mark them in your planner.",
            "Create a to-do list. Sure, a to-do list sounds oddly similar to using a planner to schedule your days. However, think of your to-do list as breaking down your day into even smaller, more manageable pieces. Don’t list major, vague projects (such as clean the house or workout more). Give yourself some clear direction with short, easy tasks (like clean the kitchen, scrub the toilets, and run one mile)."
          ],
          "notes": []
        },
        {
          "id": 2,
          "locked": true,
          "completed": false,
          "label": "Organize yourself Mentally 2",
          "description": [
            "Stop procrastinating. Possibly the toughest item on the list, procrastinating is a major detriment to organizing your life. Instead of putting things off, get them done immediately. Force yourself to get things done without waiting to finish them. If it can be done in two minutes or less, always do it right away while breaking down larger tasks into smaller pieces to make them manageable.",
            "Start your day out right. When you wake up, eat a good breakfast, shower or wash your face, get dressed, and put on your shoes. Do all the things you would do, every single day, as if you were going in to work at the office. This will change your mental perspective; by getting ready and making yourself presentable to the world, you have set yourself up for success.",
            "Write everything down. Whenever you have an important thought, remember something you don’t want to forget, or are reminded of something to do, write it down. This can be done in your planner or in another generalized notebook that you keep with you. Writing down your errant thoughts will not only remove them from your mind (and thus declutter your conscience), but also place them in a place that you can return back to later without forgetting.",
            "Don’t overwhelm yourself. If you find that your time is short and schedule is full, consider dropping less important things from your daily plans. Is that coffee date with your friend really necessary today? How about your plans to work on your work assignment outside of your work hours? If you are doing too many things at once, you will feel unorganized and anxiety-prone. Cancel plans when necessary to give your head a little more thinking space.",
            "Don’t be a perfectionist. If you only feel that you've completed a task when it is “perfect,” you will be leaving a lot of tasks unfinished to clutter up your life. On a similar note, if you wait to start tasks until you’re in the “perfect” decluttering mindset, you will be waiting a very long time."
          ],
          "notes": []
        },
        {
          "id": 3,
          "locked": true,
          "completed": false,
          "label": "Organize your Home and Office Life 1",
          "description": [
            "Find a place for everything you have. If your house is unorganized, you probably don’t have designated places for all your things. Instead of resigning items to a certain room or area, keep track of a very specific location for everything in your home.",
            "Declutter space by space. Choose a day during the week on which you have most (or all) of your time free. Then, choose a single area in your life that is unorganized and needs to be cleaned up. This could be rooms in your house, your car, or your office at work. Then work only on throwing out unnecessary items that are taking up space in that section of your life.",
            "Get rid of things you don’t need. Although you might assume that you 'need' everything you own, an disorganized house is probably likely to have some items you don’t. Sort through the things that constantly give you clutter and determine how useful it is to you. If you haven’t used it in a long time, don’t use it frequently, don’t like it anymore, or don’t need it, get rid of it.",
            "Don’t bring in more unnecessary items. Don’t defeat the process of organising your life by bringing in new things that you don’t need. One major reason you might do this is bargain shopping. Avoid big sales or bargains, as these will lead to you buy things that you don’t really need or want simply because you don’t want to pass up the good deal."
          ],
          "notes": []
        },
        {
          "id": 4,
          "locked": true,
          "completed": false,
          "label": "Organize your Home and Office Life 2",
          "description": [
            "Put things back right away. Everyone does it - takes out a pen from the drawer, writes a note, and then leaves it on the counter. Instead of placing things where it’s most convenient, take an extra moment to return them to their correct places.",
            "Divvy up your chores. How many times has your house become unorganised because you put off cleaning it up? Although this is tied to procrastination, you can make your list of things to clean and organise more manageable by presenting yourself with smaller tasks. Choose a single item - such as dusting - and give yourself a specific time and day to do it. If you do this with all your chores, your space will always be clean without you having to spend several consecutive hours working on it.",
            "Label everything. Do you have boxes or drawers full of mystery items, long lost from your memory? Well get out your handy label maker (or use a classic marker) and label everything you have. Keep like things in the same place, in order to make the labeling process go a bit smoother."
          ],
          "notes": []
        },
        {
          "id": 5,
          "locked": true,
          "completed": false,
          "label": "Organize your Days",
          "description": [
            "Prioritise your life. Think of 5 things that you want to be big things in your life, such as studying, exercise, healthy eating, relaxation, working, sleep etc..",
            "Make a chart. List all the days in the month ahead down the page and across the top put the 5 things that you want your days to be split up into.",
            "Decide what your aims are. Whether you aim to do 30 minutes of exercise every day or a whole hour. Put that above each one.",
            "Tick them off. Reward yourself with the pleasure of ticking something when you achieved your goal.",
            "Reward yourself. Say to yourself something like, 'If I get 100 boxes ticked, then I will go out to the cinema', or 'go on a vacation with all my friends'."
          ],
          "notes": []
        }
      ],
      "reference": "https://www.wikihow.com/Organize-Your-Life"
    },
    {
      "my_resolutions": false,
      "icon": "/icons/gainFlexibilityIcon.png",
      "backdrop": "/backdrops/gainFlexibilityBackdrop.jpg",
      "image_ref": "gainFlexibility",
      "type": "physical",
      "color": "green",
      "title": "Gain Flexibility",
      "overview": "As we age, our joints and muscles become less flexible. Fortunately, there are ways to regain the flexibility most of us naturally enjoy during our youth. Flexibility improves circulation, muscle health, and endurance.",
      "steps": [
        {
          "id": 1,
          "locked": true,
          "completed": false,
          "label": "Become Flexible through stretching",
          "description": [
            "Adopt a new attitude toward stretching. In the past, athletes and fitness buffs were advised to stretch in a way that can actually hinder flexibility. This technique, known as static stretching, involved standing still and forcing muscles or joints into a stretch, might feel good in the moment and is great for targeting particular muscles, but does not create lasting results in flexibility.",
            "Stretch after warming up for exercise. Most experts agree that stretching cold muscles can cause muscle injury or pain. Instead, consider stretching itself part of your exercise routine.",
            "Stretch every day or at least six times a week. Sit ups, crunches, and push ups are not necessary to become flexible, but an exercise program must be balanced in working the opposing muscles of a joint. Do each stretch for at least 20 seconds, and as frequently during the day or week as you prefer.",
            "Avoid deep, uncomfortable stretches. Instead of finding positions that are hard to hold for the count of the stretch, try positions that you could sit comfortably and have a conversation or watch television. It's important to hold a stretch for 30 to 60 seconds, while breathing normally. If you cannot hold it without pain and while breathing normally, you've stretched too far."
          ],
          "notes": []
        },
        {
          "id": 2,
          "locked": true,
          "completed": false,
          "label": "Use Yoga to gain Flexibility",
          "description": [
            "Try yoga. Yoga is an ideal daily practice to increase all over body strength and flexibility, as nearly every pose increases flexibility with practice. It is customizable to your fitness level and can be as easy or intense as you need it to be, all while increasing your flexibility.",
            "Try this simple routine daily. It takes only moments from start to finish, and is a great way to begin working on overall body flexibility. Try to hold each pose for five to ten breaths before moving into the next.",
            "Learn more to target more specific areas. If you have a particular flexibility goal, like doing the splits or touching your toes, there are specific yoga practices that can help. Consider joining a yoga class or following a video program to learn more poses and become more flexible.",
            "Learn about breathing techniques. Yoga is about mind-body relaxation and discipline, and one major element of that process is proper breathing. In fact, proper breathing during yoga (and other stretching activities) can further the stretch itself by relaxing the body and increasing oxygen flow to the muscles under focus."
          ],
          "notes": []
        },
        {
          "id": 3,
          "locked": true,
          "completed": false,
          "label": "Target Specific Muscle Groups",
          "description": [
            "Target your shoulders. In order to gain flexibility in your shoulder muscles, you must target stretches in both the shoulder area and it's mirror area in the chest.",
            "Stretch your hamstrings. Because this is a vulnerable muscle often injured by athletes, take extra care to stretch it after you are warmed up.",
            "Focus on your back. Divide this area into the dorsal (back) and ventral (front) and limit it to the muscles of the hip and spine.",
            "Target your legs. Particularly if you are a runner or cyclist, leg stretches are vital for maintaining range of motion."
          ],
          "notes": []
        }
      ],
      "reference": "https://www.wikihow.com/Gain-Flexibility"
    },
    {
      "my_resolutions": false,
      "icon": "/icons/liveGoodFamilyLifeIcon.png",
      "backdrop": "/backdrops/liveGoodFamilyLifeBackdrop.jpg",
      "image_ref": "liveGoodFamilyLife",
      "type": "lifestyle",
      "color": "navy",
      "title": "Live Good Family Life",
      "overview": "Improving your family life can help make your family members closer and prevent conflicts from getting in the way of everyone's happiness. Fortunately, there are lots of concrete steps you can take to make your time with your family more enjoyable and fulfilling.",
      "steps": [
        {
          "id": 1,
          "locked": true,
          "completed": false,
          "label": "Spend Quality Time Together",
          "description": [
            "Maintain daily and weekly family routines. Eat, go to sleep, and do regular family activities according to a predictable schedule. Routines and rituals help establish a family identify, reduce stress, and create a stable, comfortable environment.",
            "Make celebrating birthdays and holidays together a family tradition. You don’t have to do the same thing every birthday or holiday. For instance, you could go to a family member’s favorite restaurant or do their favorite activity on their birthday. You’d be sticking to a tradition, but the activities would be varied.",
            "Have meals together as often as possible. Parents work and kids have after school activities, so it’s tough to have breakfast and dinner together every day. However, do your best to eat together as often as possible. Family meals are a key routine and can help you stay involved in each other’s lives.",
            "Set aside time for regular family activities. Regular activities could include bike rides, walks, or playing cards or board games. If possible, dedicate at least an afternoon or evening per week for a family activity. Keep it low-key, and focus on having fun together and enjoying each other’s company.",
            "Do household chores together. Few people actually enjoy doing chores, but sharing household responsibilities can help everyone in your family take pride in your home. Try to make it as fun as possible, such as by playing music or having contests."
          ],
          "notes": []
        },
        {
          "id": 2,
          "locked": true,
          "completed": false,
          "label": "Improve Communication",
          "description": [
            "Respect what your family members have to say. When someone expresses an opinion, don't dismiss it or interrupt them before they can finish speaking. Maintaining open, respectful communication channels will help your family develop trust and strengthen your bond.",
            "Avoid harsh criticism and judgments. Give each other permission to express emotions and act silly without fear of criticism or judgment. When people expect harsh judgment, they tend to bottle things up and avoid sharing their feelings.",
            "Listen to your family members actively. Active listening is when you absorb what the other person says and convey that you’re paying attention. Make eye contact with them, nod your head, and say things like, 'I understand,' when appropriate. Just listen instead of planning on what you’ll say next, and don’t give advice or your opinion until the other person has finished.",
            "Express love and appreciation frequently. Little verbal and nonverbal gestures of affection go a long way. In addition to saying “I love you,” try to find small, specific ways to show you care for each other.",
            "Avoid comparing your family to those you see on social media. It can be easy to believe that because other people always look happy in their pictures and videos that they really always feel that way. However, it's important to keep in mind that every family has to work to keep their relationships healthy and strong. If you start to envy someone else's family, just remind yourself that you don't know what their life is really like, and they likely have family arguments and other issues just like everyone else.",
            "Have upbeat weekly family meetings. A family meeting doesn't have to be formal or focus solely on heavy topics. Every week, turn the TV off and put away the phones, and hang out with each other for an hour or so. Talk about the past week’s ups and downs, any upcoming events, and just shoot the breeze with each other."
          ],
          "notes": []
        },
        {
          "id": 3,
          "locked": true,
          "completed": false,
          "label": "Handle Conflicts as a Parent",
          "description": [
            "Balance your role as a parent with your child’s need for freedom. One of the key conflicts in any family is between a parent’s need to keep their child safe and a child’s need for freedom. Remain a figure of authority, but give your children opportunities to earn your trust. Slowly increase their freedom and privileges as they mature.",
            "Try to set a positive example if you’re arguing with your spouse. If you and your spouse have an argument, remember that the way you resolve disagreements teaches your children about conflict resolution. Stick to the specific issue instead of bringing up past offenses or resorting to personal attacks. If necessary, sort out an argument when your children aren’t present.",
            "Mediate your kids' fights only when necessary. If possible, let your kids sort out their arguments on their own. Set ground rules and intervene only when the rules are broken or your kids can't cool down by themselves.",
            "Communicate clearly and directly when resolving disagreements. Avoid being passive-aggressive, vague, or sarcastic, especially when handling a conflict. Say what’s on your mind, and encourage your family members to do the same."
          ],
          "notes": []
        },
        {
          "id": 4,
          "locked": true,
          "completed": false,
          "label": "Handle Conflicts as a Child",
          "description": [
            "Respect your parents' need to protect you. While children need increasing degrees of freedom as they get older, remember that your parents are in charge. Their job is to keep you safe and give you the tools you'll need to take care of yourself when you're an adult.",
            "Find ways to compromise if you're fighting with a sibling. Try to avoid blaming or shaming the other person, and say, 'Time out - let’s think of a way we can come to an agreement about this.' Keep your cool and find ways you could share a toy or play together.",
            "Try to see things from your family member’s point of view. Before jumping to conclusions, take a deep breath and try to stay calm. If someone ate your favorite snack or stole your clothes, try to see things from their perspective before getting angry.",
            "Avoid getting involved if your parents are arguing. When your parents have an argument, just let them work it out on their own. Don’t try to be the referee or otherwise get involved. Go to another part of the house, listen to music, or find something else to do until they stop arguing."
          ],
          "notes": []
        }
      ],
      "reference": "https://www.wikihow.com/Have-a-Good-Family-Life"
    },
    {
      "my_resolutions": false,
      "icon": "/icons/reviseEfficientlyIcon.png",
      "backdrop": "/backdrops/reviseEfficientlyBackdrop.jpg",
      "image_ref": "reviseEfficiently",
      "type": "intellectual",
      "color": "purple",
      "title": "Revise Efficiently",
      "overview": "Your upcoming exams may seem like the end of the world, but there's no reason to fear them! By using some simple and effective revision techniques, you can keep yourself engaged with your studies without turning into a research zombie.",
      "steps": [
        {
          "id": 1,
          "locked": true,
          "completed": false,
          "label": "Organize Your Revision",
          "description": [
            "Find a good place to study. Find a quiet, well-lit place to work that will be comfortable and free of distraction. Log-out or temporarily disable social media like Facebook, Twitter or Instagram.",
            "Some studies show that studying information in different places allows you to compartmentalize the information, making it easier to recall at a later date if you can associate the information with the location.",
            "Draw up a timetable for your revision and stick to it. What do you hope to cover by the end of the week? By the end of the day? Working from a revision timetable helps you to make clear goals for each revision session and allows you to check them off as you progress. Revision plans can reduce anxiety, reassuring you that you've taken the necessary steps.",
            "Set reasonable study targets that you know you can reach. Going over twelve chapters of trigonometry the night before a big exam is probably going to do more harm than good. Likewise, trying to revise all that Shakespeare several weeks out before being tested might not be the best way to remember the information by test-time. Organize in the most effective way to remember the most important information you've got to study.",
            "You could revise throughout the year by spending 15 minutes each day making notes you'll be able to rely upon later. By doing it in short stretches, you will remember more and feel less stressed. A month before your exam, you will have finished all your notes so you can spend a few hours a day reviewing notes and doing timed writing practice.",
            "If your exam is a long way off, after each lesson write up your new notes on a flash card and keep it with your work. This way you're consolidating your knowledge and saving time and panic at the end of the year. DO NOT PANIC - it is NEVER too late. You've already started the journey here, and stressing out is the last thing you need to do."
          ],
          "notes": []
        },
        {
          "id": 2,
          "locked": true,
          "completed": false,
          "label": "Revise Actively 1",
          "description": [
            "Engage your texts. Rather than simply reading quickly over the sometimes-dull texts you've got to study, take a more active role by making Q cards with your own questions on, 5 or so questions per card is appropriate and should cover all the information in the text. These questions can then be used for self-testing or get a friend/family member to quiz you, if you get it wrong, the answers are on the back! Bright colors help make this bit more fun too as-well as organizing your subjects.",
            "Also, you could: highlight your notes/book, mind map/summarize the ideas on each page or TEACH what you've learned to a friend or family member. The best test of knowledge is if you can teach it-remember: 'If you can't explain it simply- you don't know it well enough.' (Albert Einstein) By turning your revision into an activity you must participate in, you can liven it up a bit and help your memory work more effectively.",
            "Ask open-ended questions of each text or subject you revise by writing questions in the margin, or on a separate sheet of paper. Try to think about the consequences should certain elements of it be changed, or should certain features occur differently. Whether it is science or history, small changes can make big differences and your thinking process is the important part.",
            "Recall and summarize. As you're studying, stop every few minutes to recap what you've read. Write a short summary--a few sentences--in your notes, or at the bottom of the page. Use your own words. A good way of recalling is writing your notes down from memory and then going back over them and filling in the gaps with another color of pencil or pen. You'll know the different color refers to information you might have trouble remembering.",
            "Periodically, Try to repeat the process of summary, writing down on a separate sheet of paper what you know about a given topic or subject without consulting your books or your previous notes. Compare your new notes to your old, finding what you've left out and what you still need to memorize."
          ],
          "notes": []
        },
        {
          "id": 3,
          "locked": true,
          "completed": false,
          "label": "Revise Actively 2",
          "description": [
            "Draw or doodle freely while you study. For a visual learner, it's important to break down information into drawings or diagrams, to make recall easier in the long run. Diagrams, mind maps, and freehand drawings can be useful ways of improving both your understanding and creating a much easier memory aid than reading the text alone. Do not be afraid to use colors in much the same way––color your drawing or highlight the text.",
            "Find someone who knows nothing about the topic and explain to them. Even if it is explaining to the mirror or your cat, just take the time out to talk to someone as if the person is learning about it for the first time, and you are the teacher. It is hard to forget information once you have done this, and also forces you to clarify the information and lay it all out in the most concise and simple way possible.",
            "Try to use a study guide or old test. Answering past exam or test papers in the same time limit, as the real exam or test will be gives you an opportunity to test yourself under the same constraints. It will be a chance to see whether there are gaps in your knowledge that you need to go back over and it'll also be useful to see if you can get down all that you want to say in the time allotted. Do the practices under timed conditions by using a timer, which could be on your phone.",
            "Take breaks periodically to give your concentration a boost. If you take breaks regularly, your concentration will be better and you will find yourself retaining more information than if you try to plow straight through. Don't waste energy and time revising with an over-tired mind that won't remember what it just read."
          ],
          "notes": []
        },
        {
          "id": 4,
          "locked": true,
          "completed": false,
          "label": "Find support",
          "description": [
            "Talk to your teachers. Look on your teachers and professors as part of your support network and use them for the resource they offer. Ask for their assistance when it becomes clear you need it. Knowing earlier rather than later in your revision will make it easier to approach them and get their help.",
            "Revise with other classmates. Find a suitable group of good students who hope to succeed, and schedule regular meetings in between your other revision activities. Discuss the topics of revision, helping each other solve problems, understand the materials, and test one another over the reading. Studying in a group can be a great way of reducing anxiety levels and making revision fun, as well as productive.",
            "Let your family help you. Your family can help support you even when they cannot understand what you are learning. Ask them to test you, clarify problems for you, read with you, and help you to stay organized. Parents and siblings who have already experienced revision will have some good ideas to help you prepare. Moreover, family and friends can be good moral support when you are feeling down or anxious about the revision.",
            "Stay relaxed. Spend time doing something relaxing each day, such as listening to your favorite music, going for a walk or swim, spending time with your pets or talking with a good friend. These activities will help you to feel relaxed and connected to others and the world as you keep working through the revision. You can also practice relaxation exercises, meditation, or simply just lying back and chilling out now and then...Possibly with a Q card in your hand."
          ],
          "notes": []
        }
      ],
      "reference": "https://www.wikihow.com/Revise-Successfully"
    },
    {
      "my_resolutions": false,
      "icon": "/icons/improveSkinHealthIcon.png",
      "backdrop": "/backdrops/improveSkinHealthBackdrop.jpg",
      "image_ref": "improveSkinHealth",
      "type": "grooming",
      "color": "fuchsia",
      "title": "Improve Skin Health",
      "overview": "Skin care involves more than just cleaning it and using lotion. It also involves having a healthy diet, getting enough sleep and exercise, and managing stress levels. Your unique skin type may also determine any additional treatments as well, such as using exfoliating scrubs or moisturizing masks.",
      "steps": [
        {
          "id": 1,
          "locked": true,
          "completed": false,
          "label": "Keep Your Skin Soft, Clean, and Moisturized",
          "description": [
            "Wash your face twice daily to keep it oil-free, improve complexion, and prevent breakouts. You should wash your face in the morning when you get up, and in the evening before going to bed. Use lukewarm water and a facial cleanser suitable to your skin type. You can wash your face with clean hands, a washcloth, or a soft sponge.",
            "Skip the hot water when bathing or showering, and use lukewarm water instead. Hot water can feel relaxing, but it can also strip your skin of its natural oils. This can lead to dry, patchy skin. If you have dry skin, use a moisturizing body wash with natural oils, such as almond, coconut, or olive oil.",
            "Gently pat your skin dry with a towel. This applies to both the skin on your face and on your body. It would be even better to leave your skin slightly damp. This way, your skin can absorb the excess moisture and re-hydrate itself.",
            "Apply moisturizer or lotion while your skin is still damp. Use facial moisturizers and creams on your face, and lotions or body butter on your body. Change the type of moisturizer or lotion you use depending on the season. Use a heavier, richer one during the winter, and a lighter one during the summer.",
            "Consider a moisturizer that contains SPF to guard your skin against the sun's harmful rays. All skin types benefit from moisturizer, including oily! Opt for a lightweight or gel-based moisturizer intended for oily skin."
          ],
          "notes": []
        },
        {
          "id": 2,
          "locked": true,
          "completed": false,
          "label": "Take extra care",
          "description": [
            "Exfoliate your skin once a week. This will help buff away those dead skin cells and leave your skin feeling silky-smooth. You use scrubs, loofahs, and exfoliating sponges. Be sure to use a gentler exfoliator on your face than on the rest of your body. Remember, the skin on your face is much more delicate than the skin on your arms and legs.",
            "Choose exfoliating scrubs carefully. The larger the grains, the more abrasive the scrub will be. Avoid scrubs with walnut shells if you have sensitive skin. If you have dry skin, you may want to exfoliate daily. Be gentle about it, and always moisturize afterwards.",
            "Don't be afraid to wear makeup, but do it with care. Use makeup that is suitable for your skin type, and remove it before going to sleep to prevent breakouts. If you wear makeup daily, avoid wearing any makeup for a day or two to give your skin a break.",
            "Read product labels carefully, especially if you have sensitive skin. Not every ingredient in skincare products is safe for skin. Avoid products containing the following ingredients: paraben, phthalates, propylene glycol, and sodium lauryl sulfate. Keep in mind that 'paraben' doesn't always appear by itself. It usually is part of a longer ingredient, such as methylparaben, propylparaben, and butylparaben."
          ],
          "notes": []
        },
        {
          "id": 3,
          "locked": true,
          "completed": false,
          "label": "Eat and Drink for Healthier Skin",
          "description": [
            "Drink 6 to 8 8-ounce (240-milliliter) glasses of water each day. Have you noticed your skin looking a little dry and dull lately? If so, you might not be drinking enough water. Try it for a week, and note the improvements. Drinking 6 to 8 8-ounce (240-milliliter) glasses of water may sound like a lot, but it will leave your skin looking youthful, bright, and glowing.",
            "Eat lots of fruits and vegetables. They are not only good for your body, but they are great for your skin. They are full of vitamins and antioxidants. Apricots, blueberries, yellow bell peppers, avocados, carrots, pumpkin, kiwi, tomatoes, spinach, kale, and other dark, green, leafy vegetables.",
            "Don't shy away from fatty fish, such as salmon, sardines, and mackerel. They contain omega-3 fatty acids, which can help keep your skin looking clear.[9] They may also help prevent aging and sun damage, and improve skin elasticity.",
            "Eat dark chocolate, but in moderation. Chocolate is typically seen as being unhealthy, but if you stick to 1-ounce (15-gram) portions, you can get all its benefits without packing on weight. It contains antioxidants, which help hydrate skin. It can also help improve skin texture and appearance and prevent acne and aging.",
            "Don't be afraid of fats, but make sure that they are the good kind. Olive oil contains monounsaturated fatty acids, which can help keep your skin looking youthful.[13] You can also find healthy fats in eggs, nuts, and fatty fish, such as salmon. Avoid the bad kind of fats found in junk food and sweets.",
            "Avoid skin-damaging foods. This includes processed or refined carbohydrates as well as unhealthy fats. Consuming too many of these make your skin age faster. Avoid consuming too many sugars as well. In general, aim to eat whole foods in a variety of colors, and try to get plenty of protein and fiber. Steer clear of most packaged, processed foods."
          ],
          "notes": []
        },
        {
          "id": 4,
          "locked": true,
          "completed": false,
          "label": "Improve Your Lifestyle for Healthier Skin",
          "description": [
            "Get 7 to 9 hours of sleep each night. Not getting enough sleep can make your skin appear dull and sallow. It can also result in bags or shadows under your eyes. Getting enough sleep will reduce wrinkles and under-eye puffiness. It will also give you a healthy, glowing complexion.",
            "Reduce your stress levels. Stress can not only wreak havoc on your mind and sleep, but your skin as well. It can lead to acne, breakouts, and other skin problems. Set realistic goals and limits for yourself, and leave time each week so that you can do things that you enjoy.",
            "Make sure you get a few hours of exercise each week. Exercise increases blood flow to your skin and supplies it with oxygen and nutrients. If you exercise hard enough, the sweat will help flush out the toxins in your skin. Exercise may also help reduce stress.",
            "Avoid spending too much time in the sun, and always wear sunscreen when you do. Choose a sunscreen with a minimum of 15 SPF. You should wear it every day, even during the darker, colder winter months. Avoid the sun between 10 am and 2 pm, as this is when its rays are most harmful.",
            "Quit smoking. Smoking depletes oxygen and nutrient levels in your skin. It also damages collagen and elastin, which results in wrinkles."
          ],
          "notes": []
        },
        {
          "id": 5,
          "locked": true,
          "completed": false,
          "label": "Try DIY Skin Care Remedies",
          "description": [
            "Use an oatmeal face mask if you have acne, sensitive, or oily skin. Oatmeal is great at soothing irritated skin and absorbing excess oil. Mix 5 tablespoons (25 grams) of finely-ground oatmeal with enough water or milk to make a paste. Spread the mixture over your face and wait 20 minutes. Wash the mask off using lukewarm water, then pat it dry with a soft, clean towel.",
            "Try a yogurt mask if you have dull, dry skin. Yogurt is very moisturizing. The lactic acid in it also makes it mildly exfoliating, which can help brighten dull or sallow skin. Mix 2 tablespoons (30 grams) of full-fat Greek yogurt with 1 to 2 teaspoons of honey. Apply the mask over your face and wait 20 minutes. Wash it off using lukewarm water, then gently pat your face dry with a soft, clean towel.",
            "Put some honey on your face. Honey is hydrating, moisturizing, antibacterial, and antimicrobial. It is great for all skin types. All you have to do is spread some honey over your face and wait 15 minutes. Wash the honey off using lukewarm water, then gently pat your face dry with a soft, clean towel.",
            "Make a simple sugar scrub. Start with equal parts of sugar and oil. Mix everything together in a bowl, then massage it over your lips, face, or arms and legs.[25] Use brown sugar for a gentler scrub and white sugar for a regular scrub. You can use any type of oil you want, but coconut oil or olive oil would work best.",
            "Take a milk bath, especially if you have dry skin. Fill your tub with warm water and add ½ to 1 cup (120 to 240 milliliters) of whole milk or coconut milk. Regular milk is mildly exfoliating, and coconut milk is ultra-moisturizing. Mix it up with your hand, then step into the tub and soak for up to 20 minutes.",
            "Use natural oils to moisturize your skin. Some of the best are vitamin E oil, jojoba oil, coconut oil, and shea butter. Olive oil is great for some skin types, but it can cause some flaking for others. Simply spread the oil over your skin after a bath or shower, just like you would with regular lotion or body butter."
          ],
          "notes": []
        }
      ],
      "reference": "https://www.wikihow.com/Take-Care-of-Your-Skin"
    },
    {
      "my_resolutions": false,
      "icon": "/icons/singingIcon.png",
      "backdrop": "/backdrops/singingBackdrop.jpg",
      "image_ref": "singing",
      "type": "hobbies",
      "color": "maroon",
      "title": "Singing",
      "overview": "Almost everybody loves to sing. Although many people take singing lessons to improve their voice, you can develop your own style and confidence on your own, too. Singing can be stress relief, entertainment or even profession. Improve your singing skills by following these steps. 🎙",
      "steps": [
        {
          "id": 1,
          "locked": true,
          "completed": false,
          "label": "Explore Your Vocal Range 1",
          "description": [
            "Use a microphone to record your voice. Launch a sound recording app on your computer or smartphone. Then, adjust the audio input settings so that it records a pure, unaltered version of your voice. Practice singing to various songs and recording the outcome.",
            "To get even more comfortable with the performing process, attach a physical microphone to your computer or phone. This will help you to become familiar with how handling or singing into the microphone can impact the final sound.",
            "Sing a familiar song over and over again. Print out the lyrics of a song that you enjoy. Spend some time getting to know the nuances of the lyrics. Then, work on the details of how you can change your voice inflections to transform the song itself.",
            "It's important to choose a song that you somewhat enjoy because you'll need to work on it repeatedly over time. Also, when you are first starting out, try to sing a song that's already in your vocal range to avoid straining your voice.",
            "Work on making vocalizations using different parts of your vocal system. Singing is not just about noise coming from your throat and releasing out of your mouth. Concentrate on singing the same song, but adding vocal inflections by manipulating your tongue, mouth, diaphragm, throat, and even nose. Recording these vocalizations and playing them back can help you to understand your body and the sounds it can produce."
          ],
          "notes": []
        },
        {
          "id": 2,
          "locked": true,
          "completed": false,
          "label": "Explore Your Vocal Range 2",
          "description": [
            "Inject emotion into every song. Before you practice each song, ask yourself what emotions you'd like to convey to the listener. Then, try to interweave those emotions within each song. Work on thinking of a particular event or moment in your life that evokes emotions similar to the ones that you want to express.",
            "The key is using that moment to capture your emotions, but not being controlled by them. After all, the quality of your singing won't be improved if you cry through every sad song. For example, if you are singing a song about a break-up, then think about a negative moment in one of your relationships.",
            "Identify your vocal range. Sing along with a piano and try to match your pitch to the instrument. The lowest and highest pitch points that you can hit without your voice cracking or breaking marks your range. Make sure that you are singing with your chest, not your nose or throat, or you'll identify the wrong range.",
            "Take note of which register you're singing in as well. Typically, if you're a male, you'll need to use falsetto to sing high, airy notes. Conversely, if you're a woman, higher notes come from your head voice while lower notes are sung in chest voice."
          ],
          "notes": []
        },
        {
          "id": 3,
          "locked": true,
          "completed": false,
          "label": "Strengthen Your Singing Voice 1",
          "description": [
            "Read aloud each day. Building up your vocal prowess isn't just about practicing singing. Just using your voice in a purposeful way by reading aloud can help you to work on your inflections and to build up endurance. Pull out a newspaper or good book and read it aloud for 30 minutes each day.",
            "Warm up before singing so you don't strain your voice. Sing 'ee' softly at F above middle C (females) or F below middle C (males) and hold it for as long as you can. Repeat this exercise 2 times. Another warm-up is to sing the word 'knoll' while you glide from a low note to a high note and repeat the exercise twice. Then, do the opposite and glide from a high note to a low note while singing 'knoll' 3 times.",
            "Sing 'Do Re Mi' up and down the scales. This is another great way to warm up your vocal cords and to practice holding consistent notes. Start with the C scale, then the C# scale, and on up. Go slowly and hit each note immediately instead of sliding your way up to it.",
            "Focus on the basic scale of: 'Do Re Mi Fa Sol La Ti Do.' To add an element of excitement, you can go up by 2 notes and then jump 1, or another pattern. Then mix it up: go up 2 notes, and down 1, working your way up the scale. A scale is a series of intervals that exist between pitches. If you move up and down a scale, then you'll be singing both low and higher sounds. For example, C to C# is a scale and C# to D# is another scale."
          ],
          "notes": []
        },
        {
          "id": 4,
          "locked": true,
          "completed": false,
          "label": "Strengthen Your Singing Voice 2",
          "description": [
            "Try to sing for at least 30 minutes each day. This is long enough to warm up your vocal cords, but not extended enough that it could strain them. It's best if you can use this as undisturbed practice time. However, if you get a job singing, this could also provide an opportunity to develop your skills in a public setting.",
            "Singing in public for a short period each day can teach you how to read and work with an audience as well. You might be able to get a job singing by approaching local places with small stages or performance areas, such as coffee shops. If this isn't an option, you can also offer your skills on a volunteer basis by participating in a church choir or other group.",
            "Work on maintaining proper singing posture. Stand up with your back straight and your face looking forward. Make sure that your shoulders are back and your neck isn't overly bent. Rest your tongue lightly at the bottom of your mouth, so that it almost touches your front bottom teeth. Slide your jaw from side to side gently to keep it relaxed.",
            "Do breathing exercises to strengthen your diaphragm. Try costal breathing, which means expanding your rib cage as you inhale. Keep your rib cage open and let your abdominal muscles relax when you breathe in. When you breathe out, engage your abdominal muscles."
          ],
          "notes": []
        },
        {
          "id": 5,
          "locked": true,
          "completed": false,
          "label": "Take Care of Your General Health and Voice",
          "description": [
            "Drink at least 6-8 glasses of fluids per day. Keeping your throat hydrated will help it to produce a deeper, richer range of sounds. Water that is lukewarm, but not hot, is best for your voice. Cold water can actually tighten up your throat. You can also add in 1 teaspoon (4.9 mL) of honey or a lemon slice for additional flavor and to soothe your throat.",
            "Get at least 8 hours of sleep each night. If you are fatigued, then your voice will suffer as a result. This is even more important when you'll be singing for extended periods of time. If you can't get a full 8 hours of undisturbed sleep at once, try to supplement it with short naps throughout the day.",
            "Practice deep-breathing techniques. Concentrate on taking a deep breath with your mouth that fills your lungs to the very core with air and then releasing it out through your nostrils. Try doing this repeatedly to a count, such as 1-2-in, 3-4-out. You can also watch videos online showing other deep breathing techniques or even work with a respiratory therapist.",
            "Avoid overusing your voice. Try not to talk loudly, shout, or sing to be heard above other sounds, particularly for long periods of time. Instead, use a microphone to amplify your voice when applicable. If you use your voice a lot, such as in performance or while giving a speech, give it a rest to let it recover.",
            "Don't smoke. If you are currently a smoker, reach out to your doctor for advice. They might suggest a nicotine patch or even a medicated approach to quitting smoking. It might not be possible to quit immediately, but even cutting down on smoking can have a positive effect on the quality of your voice.",
            "Watch for signs of a strained voice. If your voice sounds hoarse, raspy, or gritty, then it's possible that you've strained your vocal cords. Your throat might also feel raw or slightly painful when you try to sing or make vocalizations. If you have to exert much more energy to produce the same note as before, then your vocal cords might not be 100%."
          ],
          "notes": []
        }
      ],
      "reference": "https://www.wikihow.com/Improve-Your-Singing-Voice-Without-Taking-Singing-Lessons"
    },
    {
      "my_resolutions": false,
      "icon": "/icons/stayLookingCleanAllDayIcon.png",
      "backdrop": "/backdrops/stayLookingCleanAllDayBackdrop.jpg",
      "image_ref": "stayLookingCleanAllDay",
      "type": "grooming",
      "color": "fuchsia",
      "title": "Stay Looking Clean All Day",
      "overview": "You know what it feels like to have that lingering body odor all day. You shower, but in a few hours you are going to look as if you haven't showered in days. You will look messy, untidy, and maybe even disgusting. So your question is 'How do I stay clean looking all day?' Well, in just a few steps, you will look as if you are glowing and so clean!",
      "steps": [
        {
          "id": 1,
          "locked": true,
          "completed": false,
          "label": "Take a Shower and brush your teeth",
          "description": [
            "This is extremely important. If you start by cleaning all the dirt and grime off, you will look and smell clean. While you are in the shower, be sure to clean the following: Hair, Face, 'Privates' (this will also help eliminate body odor). If you are a girl, shave your legs, arms, underarms, private parts. Wash under arms, behind ears and neck too.",
            "If you have bad breath and food in your teeth, there is no way that you are going to look clean. If you don't have braces, use a whitening toothpaste. Be sure to brush after breakfast, after lunch, before you go to sleep. (If you're in school, eat your lunch and go to the bathroom and brush your teeth with a travel- sized toothbrush and mini toothpaste tube) Also be sure to floss everyday and use a bacteria killing mouthwash."
          ],
          "notes": []
        },
        {
          "id": 2,
          "locked": true,
          "completed": false,
          "label": "Keep your Hair clean and use deodorant",
          "description": [
            "Keep hair clean. This means washing it frequently. You don't have to wash it everyday, but you should wash it at least every other day. Another thing is to keep your hair neat. All hairstyles you do should look neat and tidy.",
            "Use deodorant. This is in its own category. Whether you are a guy or a girl, antiperspirant deodorant should be applied under arms and any other place (besides face and neck) that you experience excessive sweating."
          ],
          "notes": []
        },
        {
          "id": 3,
          "locked": true,
          "completed": false,
          "label": "Keep your Face Clean",
          "description": [
            "Keep a clean face. If you have food around your mouth on your face, it will make you look dirty. If you females have a hairy upper lip as do many females do, get it shaved, or waxed, or threaded. Also make sure your eyebrows are groomed and tidy.",
            "Keep makeup to a minimum. Do not ring your eyes with black eyeliner and mascara. This smudges and makes you look really dirty. Try a little cover up, light foundation, a little dusting of blush, neutral eyeliner if you absolutely need eyeliner, and a peachy or neutral lip gloss. Maybe even just some chap-stick. Make sure to always wash your makeup off before you go to sleep."
          ],
          "notes": []
        },
        {
          "id": 4,
          "locked": true,
          "completed": false,
          "label": "Wear Clean Clothes",
          "description": [
            "Do not wear clothes with holes, stains, etc. Do not wear clothes that don't fit you well... this doesn't mean skin tight clothing either. Make sure the clothes you wear are thoroughly washed and dried.",
            "Keep the following with you at all times. Breath mints/gum, hairbrush or comb, touch up makeup, lotion, matching spray, deodorant, nail filer/clippers, sanitation wipes, ponytail holders/bobby pins/ barrettes/ hairspray, water bottle, and chap stick."
          ],
          "notes": []
        },
        {
          "id": 5,
          "locked": true,
          "completed": false,
          "label": "Feel Clean and be consistent",
          "description": [
            "Smile. With your pretty smile, you will look happy, clean, fresh and awake. Keep a good posture. If you are slouching and walking all hunched over, you are going to look dirty and as if you have no confidence at all.",
            "Maintain these habits everyday. Feeling clean can give you positivity in your thinking and help relieve stress."
          ],
          "notes": []
        }
      ],
      "reference": "https://www.wikihow.com/Stay-Looking-Clean-All-Day-Long"
    },
    {
      "my_resolutions": false,
      "icon": "/icons/bePhysicallyFitIcon.png",
      "backdrop": "/backdrops/bePhysicallyFitBackdrop.jpg",
      "image_ref": "bePhysicallyFit",
      "type": "physical",
      "color": "green",
      "title": "Be Physically Fit",
      "overview": "There’s more to being physically fit than simply doing a bunch of exercise. How you exercise is also important, as are your diet and lifestyle choices. Knowing the ins and outs of physical fitness is an essential part of getting healthy and staying that way.",
      "steps": [
        {
          "id": 1,
          "locked": true,
          "completed": false,
          "label": "Incorporate Exercise 1",
          "description": [
            "Stretch before and after exercising. Stretching increases your flexibility, making it less likely that you will injure yourself. It also helps your body warm up before exercising and cool down after exercising. For instance, try doing push-ups before you exercise to get your body going. You can also do things like bending over to touch your toes. Another option is to stand with your arms over your head and your hands touching. Lean over to one side, and then lean over to the other, stretching your arms as you go.",
            "Get enough aerobic exercise. To be physically fit, you should get at least 150 minutes of aerobic exercise a week or 75 minutes if your aerobic exercise is more intense. Aerobic exercise helps your body absorb more oxygen, and it improves the function of your heart and lungs. You'll also find that you have more energy, and it can help with high blood pressure. This is true whether your goal is to lose fat, gain muscle or both.",
            "Incorporate strength training. You should do strength-training exercises at least two times a week. This is also true, even if your goal isn't to bulk up. Losing weight requires replacing some of that weight with muscle to get a toned look. Strength training helps you build up your muscles over time.",
            "Try chest presses. Lay on your back on a flat surface. Bend your knees. Hold a weight in each hand. Start with them at chest level with your elbows bent, and then push the dumbbells into the air. Return them back to chest level. Repeat for 6 to 8 reps and then take a break before starting again.",
            "Use bicep curls. Standing up, hold a dumbbell in one hand, palm up. Your arm should be bent at the elbow. Lift the dumbbell up to your shoulder by bending your arm up, and then bring it back down slowly. Lift it back again. Repeat 6 or 8 times, then take a break. Do the same for the other arm.",
            "Practice knee extensions. Sit on a solid bench or table where your feet don't touch the floor. Put on ankle weights. Lift your knee up until it's fully extended, then bring it back down. Repeat 6 to 8 times and then rest. Build-up sets of repetitions over time. Do the same with the other leg."
          ],
          "notes": []
        },
        {
          "id": 2,
          "locked": true,
          "completed": false,
          "label": "Incorporate Exercise 2",
          "description": [
            "Incorporate balance exercises. Balance exercises help improve your balance. Try doing balance exercises several times a week. One easy way to improve your balance is to try balancing on one leg. After a time, move to balancing on the other leg. Balance and core exercises are some of the most neglected types of exercises. Remember that everything starts from your core - even your posture during everyday life! Your core must be strong and so must your balance.",
            "Increase flexibility. Flexibility helps protect you from injury, as it's often tight muscles that are injured. It can also help you increase your muscle size, as it stretches your muscles out. To improve your flexibility, try activities such as pilates or yoga. Both of these incorporate slow movements to help stretch your muscles over time. They can also improve balance. Try joining a class at a local gym.",
            "Stretch every day or at the very least, several times a week. Stretching regularly helps stretch out your muscles, increasing flexibility the longer you do it. You can use some of the same stretches you use before workouts. However, you can also do exercises such as laying on your stomach and pushing your chest up at your shoulders, holding it for about 10 seconds. Another stretching exercise is to sit on the floor with your legs outstretched. Pull a leg up, using both your hands, and bending your foot back while you do. Hold in position for a few seconds. Move to the other leg.",
            "Don't do too much too fast. If you haven't been exercising much, don't jump into an intense exercise program. Instead, slowly increase how much you exercise over time. If you do too much too fast, you could injure yourself. As with anything new, the body needs time to adjust and gradually get up to speed. Adding too much to soon can cause injury or illness. Listen to the limitations of your body."
          ],
          "notes": []
        },
        {
          "id": 3,
          "locked": true,
          "completed": false,
          "label": "Eat Right 1",
          "description": [
            "Make protein a part of your diet. Your body needs proteins to rebuild many parts of your body, from your muscles to your blood. They also provide essential nutrients your body needs to survive. For instance, many proteins are high in iron, which carries oxygen in your blood.",
            "Pick lean proteins. It's important to choose lean proteins because proteins high in saturated fat can be detrimental to your health over time. Some good options include chicken, fish, and turkey. However, you can still eat beef, especially if you buy leaner varieties. For instance, choose ground beef that is less than 10% fat. Beans, nuts, and seeds can provide the protein you need if you are a vegetarian. Eggs are also a great source of protein if you choose to eat them on your diet.",
            "Get enough veggies. Vegetables help you get the right vitamins and minerals in your diet. They also provide you with fiber to keep your digestive tract healthy. They should make up a large portion of your diet, especially since they keep you fuller with fewer calories than many other foods.",
            "Eat your fruit. Fruits should be an important part of your diet, as they provide important nutrients, as well as fiber. Some also help keep you hydrated."
          ],
          "notes": []
        },
        {
          "id": 4,
          "locked": true,
          "completed": false,
          "label": "Eat Right 2",
          "description": [
            "Choose whole grains. When eating bread or pasta, it's best to pick ones that are made with whole grains. Also, incorporate other whole grains into your diet, such as oatmeal, quinoa, and brown rice. The government recommends that 50 percent of your grains should be whole grains.",
            "Add dairy. Though the government doesn't make a recommendation on how much dairy an adult should eat, dairy can provide calcium and other nutrients in your diet. Pick low-fat versions of your favorite dairy products to keep it healthier. If you don't eat dairy products, canned fish, such as salmon with the bones still in, is a good option for getting your calcium in.",
            "If you're vegetarian, try fortified foods. For instance, fortified cereals and juices have calcium. You'll find calcium in milk alternatives, such as rice or almond milk. You can also eat certain beans, soy foods (such as tofu), and some dark greens to get your calcium (such as kale, collard greens, or bok choy).",
            "Limit oils. Oils are an important part of your diet. They do provide nutrients you need. However, they are also high in calories, so you should limit your daily intake.[37] Women age 19 to 30 should limit themselves to 6 tablespoons. After that, they should only eat 5 tablespoons a day. Men should eat 7 tablespoons until age 30, but limit themselves to 6 tablespoons after that."
          ],
          "notes": []
        },
        {
          "id": 5,
          "locked": true,
          "completed": false,
          "label": "Stay Hydrated",
          "description": [
            "Make sure you drink enough water. Water is essential to how your body functions; in fact, water makes up about 60 percent of what you weigh. Your body cannot function properly if you don't give it enough water every day.",
            "Drink when you lose water. If you are exercising, you need to up your water intake. Similarly, if you are doing an activity that causes you to sweat a great deal, you also need to up your intake. For a small amount of exercising, you may only need a couple of cups. However, when you are doing hard work for more than an hour, you need even more.",
            "Eat your fruits and vegetables. If you are getting enough fruits and vegetables, that can help your water intake, especially if you choose ones high in water content. Examples of fruits and veggies with a high water content include leafy greens, watermelon, and cucumber.",
            "Pick hydrating drinks. Your water intake doesn't need to come solely from pure water; other drinks count towards your total. However, you should skip drinks that dehydrate you rather than hydrate you.",
            "Flavor your water. If you're not a huge fan of drinking plain water, you can spice it up a bit. Add a slice or two of citrus to give it flavor. You can also add other fruits and even veggies to your water for better flavor. Try muddled berries or cucumber."
          ],
          "notes": []
        },
        {
          "id": 6,
          "locked": true,
          "completed": false,
          "label": "Make Healthy Choices",
          "description": [
            "Get enough sleep. While it's tempting to stay up late finishing a great book, getting enough sleep is essential to staying healthy. It also keeps you happier and more alert. Make sure you are getting the required 8 hours of sleep a night.",
            "Go to your annual physicals. It's important to have yourself checked out at least once a year by a doctor. That way, the doctor can monitor you for any conditions you might develop, such as high cholesterol or high blood pressure, and get you started on treatment early.",
            "Drink alcohol only in moderation. Recent research has shown that some alcohol may be beneficial, especially wine. It may help reduce your risk of heart disease and stroke.[55] However, too much drinking can lead to a slew of health problems, from higher risk of cancer to liver disease and high blood pressure.",
            "Stop smoking. Smoking affects all parts of your body. It decreases your lung capacity, making it harder to exercise. It increases your blood pressure, putting you at risk for heart disease. It can also make it harder to increase muscle size because not as much oxygen is reaching them.",
            "Incorporate movement into your everyday life. Increasing how much you move overall, even if it's not aerobic exercise, will make you more fit. For instance, park your car farther out in the parking lot when you go places; you'll need to walk more to get inside. Choose to go up the stairs, skipping the elevator. Instead of sitting while you're on the phone, walk around. All of the little things will come together to make you a healthier person."
          ],
          "notes": []
        }
      ],
      "reference": "https://www.wikihow.com/Be-Physically-Fit"
    },
    {
      "my_resolutions": false,
      "icon": "/icons/dancingIcon.png",
      "backdrop": "/backdrops/dancingBackdrop.jpg",
      "image_ref": "dancing",
      "type": "hobbies",
      "color": "maroon",
      "title": "Dancing",
      "overview": "If a little crisis of confidence or some uncertainty about how to move is keeping you from joining the fun on the dance floor, don’t worry. If you take the time to master a few basic moves, you can learn to dance freestyle, do a romantic slow dance, or impress your fellow guests on the dance floor at the next family wedding.",
      "steps": [
        {
          "id": 1,
          "locked": true,
          "completed": false,
          "label": "Dress to Dance",
          "description": [
            "Put on comfortable dance shoes. Choose a well-fitting shoe with a flexible, thin sole for the dance floor. Stay away from platform shoes, since that thick sole and heel make it difficult to feel the floor. Be sure, too, that your feet feel secure in your shoes. Backless sandals are best left at home. Do not wear sneakers or other shoes with rubbery or sticky soles for ballroom style dancing, since these can make it hard to move your feet smoothly across the floor.",
            "Different styles of dance call for different types of shoes, so do some research about what’s needed for your preferred style. For example, sneakers are great for hip hop or freestyle dancing, while heels are ideal for Latin dance styles.",
            "Be prepared for the heat. If you tend to perspire, choose garments made of natural fibers. Tank tops and halter tops can look great, but sweaty or clammy skin could be a turn off if a partner asks you to dance. Drop a pack of moist towelettes and a travel-size powder in your pocket so you can freshen up when needed.",
            "Wear clothes that allow you to move. Tight satin might look and feel great when you’re not moving much, but it could inhibit your moves on the dance floor. Even worse, one wrong move could leave you with an embarrassing rip. Choose clothes that are either loose enough to let you move or stretchy enough to move with your body. Select a top with sleeves that don’t restrict your arm movement—you should be able to lift your arms above your head."
          ],
          "notes": []
        },
        {
          "id": 2,
          "locked": true,
          "completed": false,
          "label": "Freestyle 1",
          "description": [
            "Bob your head to the rhythm. Start by trying to find the beat of the music. If it helps, try counting along, clicking or clapping your hands to the beat.[1] Once you’ve figured out the rhythm, start moving to it by bobbing your head.",
            "Once you get your head moving, it will make it easier for you to get the rest of your body going. To find the beat, try listening to the drums or the bass. These instruments usually carry the rhythm of the song.",
            "Shift your weight from one foot to another. When you have a good sense of the beat, you can start incorporating some simple footwork. Start by shifting all of your weight to one foot. You can lift the other foot slightly off the ground to make sure all your weight is off of it. Shift back and forth in time to the music.",
            "At every other count, shift your weight completely to the other foot. You can also shift your weight at every count but by starting out slowly, you will get comfortable before you begin dancing fast. Keep your legs loose and your knees slightly bent. There should be just a bit of 'bounce' to your weight shift, and a subtle bounce (in place) on the counts when you aren't shifting your weight.",
            "Move your feet to the beat. Once you're comfortable shifting your weight to the rhythm, begin moving your feet. Right before you shift your weight to a foot, move it slightly, even just 1–2 inches (2.5–5.1 cm) from where it was before. When you move your foot, keep it fairly close to the ground.",
            "Stay on the balls of your feet so you can move and bounce easily. If you're dancing with someone else, be sure to move around in a way that accommodates your partner."
          ],
          "notes": []
        },
        {
          "id": 3,
          "locked": true,
          "completed": false,
          "label": "Freestyle 2",
          "description": [
            "Add some hip action. When you put your weight on a foot, move your hips (and your body) slightly in the direction of that foot. If you shift your weight onto your right foot, for example, move your hips to the right. You can twist your body slightly to add a little more movement.",
            "Incorporate some arm movements. If you're uncomfortable, the tendency is to keep your arms close or to let them hang limp. Instead, move your arms around. Keep your hands open or in very loose fists. You can put your arms in the air or bend them at the elbows and hold them at your sides, like when you’re running. Whatever you do, don't get stuck on just one move; keep switching it up!",
            "Find your own style. Follow your natural impulses when you’re dancing freestyle. It's easy to feel like you're only good at one move, but the more you feel the rhythm, the more natural your movements will become. Listening to subtleties in music will also help to train your body to move. Most importantly, be creative! Creating your own dance moves is easy with confidence and an understanding of your body.",
            "Experiment with different moves, positions, and speeds while you dance. Don’t be afraid to make up your own moves. Free style is all about improvisation and individual expression."
          ],
          "notes": []
        },
        {
          "id": 4,
          "locked": true,
          "completed": false,
          "label": "Slow dance with a Partner",
          "description": [
            "Get into position with your partner. Stand face-to-face with your partner and get into a basic partner position. If you are leading, put your right hand on your partner’s shoulder blade and interlock your left hand with their right hand, with your hands positioned in the shape of a pair of Cs. Your partner will put their left hand on your right shoulder.",
            "Step to the left with your left foot. Once you’re ready to start dancing, move your left foot out to the side in a smooth, gliding motion. Your partner will mirror you with their right foot. This is the first part of the basic “step-touch” slow dance move.",
            "Bring your right foot over to meet your left. After taking the first step with your left foot, slide your right foot over so that it touches your left. Your partner should mirror this movement.",
            "Repeat your foot movements in the opposite direction. Once you’ve brought your feet together, step to the right with your right foot. Then, bring your left foot over to meet your right. Continue this pattern throughout the rest of the dance.",
            "Use your hands to steer your partner if you want to move around. If you’d like to move around the dance floor, use your hands to gently push or pull your partner in the direction you’d like to go. After touching your feet together, push with one hand and pull with the other at the same time that you step out on the next beat."
          ],
          "notes": []
        },
        {
          "id": 5,
          "locked": true,
          "completed": false,
          "label": "Get all the Right Moves",
          "description": [
            "Take a dance class to learn some basic moves. There are dance classes for every style of dancing from hip-hop to ballet, break dancing to salsa. Search online for the classes in your area. Whatever style of dance you're interested in, you could probably benefit from a ballroom dancing class as the steps of many other dance styles have their roots in some ballroom basics.",
            "Join a flash mob to boost your confidence. A flash mob is a spontaneous public performance—usually a dance—that appears seemingly out of nowhere and then disappears just as quickly. While these dance performances may seem spontaneous, the truth is that they're usually fairly well rehearsed in advance. You can find flash mobs online, join them for a several-week rehearsal period as the group learns a dance, and then perform with the mob in public.",
            "Watch dancing on TV to find inspiration. Dancing is a wildly popular activity, and you can get plenty of exposure to it just by watching TV.[18] Try tuning in to reality television dance competition shows. Focusing on the steps might be a bit challenging. Instead, pay attention to how loose the dancers are, how much confidence they display, and how much fun it looks like they're having on the dance floor.",
            "Rent a classic dance movie to get new ideas. There are so many dance movies to choose from. See as many as you can or pick and choose those that speak to your particular interests. For example, Dirty Dancing, Shall We Dance, Footloose, Flashdance, Stormy Weather, etc.",
            "Participate in a dance competition to hone your skills. Ballroom dancing competitions, officially known as DanceSport events, are held all over the world. Check online for a competition near you. Joining a dance competition can help you set specific goals for yourself and encourage you to build your skills."
          ],
          "notes": []
        }
      ],
      "reference": "https://www.wikihow.com/Dance"
    },
    {
      "my_resolutions": false,
      "icon": "/icons/conquerYourFearIcon.png",
      "backdrop": "/backdrops/conquerYourFearBackdrop.jpg",
      "image_ref": "conquerYourFear",
      "type": "lifestyle",
      "color": "navy",
      "title": "Conquer Your Fear",
      "overview": "Everyone experiences fear sometimes. Fear can actually help keep you safe by alerting you to potentially dangerous situations. However, there are times when fear runs amok and disrupts your daily life. Fortunately, there are things you can do to address your fears and minimize the impact it has on you.",
      "steps": [
        {
          "id": 1,
          "locked": true,
          "completed": false,
          "label": "Understand Fear",
          "description": [
            "Recognize when fears become overwhelming. It’s normal to have fears. You may experience fear when you ride a bike for the first time or when you start a new job. However, when fears begin to take over your life and affect your functioning, they become a problem. If your fears feel overwhelming, the distress from the fear can interfere with your ability to function and you may experience intense anxiety or nervousness. Reflect on your fears and notice how much they affect your life.",
            "Understand symptoms of fear. Fears often manifest as phobias, which can include situations (fear of public speaking or raising your hand), animals (fear of snakes or spiders), blood, injections, etc. When you experience fear, physiological, mental, and emotional reactions occur, which can include Racing heartbeat, Difficulty breathing, Feeling dizzy, Sweating, Overwhelming anxiety, panic, Feeling pressured to do it, Needing to escape, Feeling detached, Feeling like you may faint or die, Feeling powerless to your fear, even if you know it’s irrational",
            "Reflect on any traumatic events. If you’ve experienced a car crash, driving a car may become fearful or you may avoid it altogether. Or perhaps you were robbed walking home, and the thought of walking home again creates panic.There are many ways that fears develop, and it’s natural to avoid previously harmful experiences.",
            "Consider that origins can begin young. You may have an intense fear of snakes but not know why. Some evidence suggests that fears can be shared between parents and children with a biological link. Other evidence suggests that children in particular decode environmental information and develop fears based on what they observe may be a threat. By watching adults interact with an object or situation, the child learns to create associations such as 'fearful' or 'potentially harmful' regardless of an actual posed risk.",
            "Realize that it’s okay to have fears. Fear is an adaptive function that prolongs our lives. Do you walk up to a cliff’s edge and suddenly feel fearful? This is adaptive fear, and it tells you, 'This could be dangerous and cost you your life. Take caution.' Fear triggers a 'fight-or-flight' response, which readies our bodies to take action in order to protect ourselves."
          ],
          "notes": []
        },
        {
          "id": 2,
          "locked": true,
          "completed": false,
          "label": "Interact With Your Fear",
          "description": [
            "Acknowledge your specific fears. It's easy to ignore or deny your fears, even to yourself. But courage can't come into play unless you have a fear to face down. By owning your feelings you've taken the first step toward gaining control over the situation.",
            "Understand your triggers. Is it something obvious, like the sight of a snake on a trail? Maybe passing your career counselor's office door sends your mind into a downward spiral when you walk down the corridor in your high school. Figure out everything that triggers your fear. The more you can understand your fear, the better.",
            "Question the power the fear holds over you. Does your fear cause you to stay in bed instead of getting up and going to a class you're afraid of failing? Do you avoid visiting your family in another state because you don't want to get on a plane? Figure out exactly what power your fear has over your mind and behavior.",
            "Imagine the outcome you desire. Now that you better understand your fear, think about what exactly you want to change. Think about yourself experiencing life without your fear. How do you feel? If your fear is commitment, imagine yourself happily with a partner. If your fear is heights, imagine yourself conquering a tough hike. Connect with the feeling of accomplishment. If your fear is spiders, imagine yourself seeing a spider and feeling neutral."
          ],
          "notes": []
        },
        {
          "id": 3,
          "locked": true,
          "completed": false,
          "label": "Face Your Fears",
          "description": [
            "Identify false beliefs. Many fears are based in false beliefs or catastrophic thinking. When you see a spider, you may immediately have a belief that says that the spider will harm you, and that you will die. Identify these patterns of thinking, and start to question them. Do some online research and understand your actual risk versus perceived risk. Recognize that the worse-case scenario is highly unlikely. Begin to re-structure your thoughts to not engage in catastrophic thinking, and start to talk back to those thoughts.",
            "Try gradual exposure. After you have confronted your false beliefs, begin to expose yourself to the fear. Oftentimes we're afraid of something because we haven't been exposed to it very much. 'Fear of the unknown' is a commonly used phrase to describe the automatic aversion people feel to something that's different.",
            "Practice engaging with the fear. The power to label your emotions is beneficial for self-understanding and emotional intelligence. It also appears that engaging with a fear and verbalizing your fear has incredible power to help you overcome fears and regulate emotions. Researchers had spider-fearful individuals exposed to a spider, and participants that labelled their fears (“I feel very scared of this spider”) had a lower fear response the following week when exposed to a different spider.",
            "Learn relaxation techniques. When your body experiences fear, lots of triggers ready your body for a “fight-or-flight” action response. Learn to override this response by counteracting with relaxation techniques. Relaxation tells your body that there is no danger and that you are safe. Relaxation can also help you cope with other stress and anxiety in your life."
          ],
          "notes": []
        },
        {
          "id": 4,
          "locked": true,
          "completed": false,
          "label": "Benefit from your Fears",
          "description": [
            "Make your fear a source of fascination. The same things we fear also incite feelings of exhilaration and even passion. That's why people enjoy extreme sports, horror movies, and swimming with sharks on vacation. Try to re-frame your fear in a positive light and acknowledge the thrill it can offer. When you start seeing fear as a source of energy, you might even embrace its role in your life.",
            "Harness the power of fear. Fear can have incredible power in life-or-death situations. People report the sensation of time slowing down, senses becoming highly acute, and having the ability to instinctively know what to do. While other communication within our bodies takes about half a second to reach awareness, the fear system works much more quickly. Fear also deadens our awareness of pain.",
            "Understanding the positives of fear can help you use it to your advantage. For instance, many people experience stage fright, yet the fear leading up to a performance can help you be in the moment and focus intensely on what is before you. Learn to acknowledge the fear and then direct it to where it will be most beneficial",
            "Start seeing fear as an opportunity. Fear can be used as a tool to help us identify problems and solve them effectively. It's a guidepost, a red flag that warns us when something needs attention. Once the discomfort of the initial wave of fear passes, examine it more closely to see what you can learn."
          ],
          "notes": []
        }
      ],
      "reference": "https://www.wikihow.com/Overcome-Fear"
    },
    {
      "my_resolutions": false,
      "icon": "/icons/giveBackToCommunityIcon.png",
      "backdrop": "/backdrops/giveBackToCommunityBackdrop.jpg",
      "image_ref": "giveBackToCommunity",
      "type": "social",
      "color": "orange",
      "title": "Give back to Community",
      "overview": "Giving back is an important way to stay engaged in our community and to be a good citizen. There are ways to give back to your community even when you are low on financial funds or resources. Volunteering and giving back your time is a great way to invest in the well-being of your community. Giving back to causes and organizations that you care about will often benefit everyone involved!",
      "steps": [
        {
          "id": 1,
          "locked": true,
          "completed": false,
          "label": "Find ways to Give 1",
          "description": [
            "Identify causes that you care about. If you are interested in supporting your community in a specific way, you can tailor your volunteering and charitable giving based on causes. Usually, charitable organizations have a mission that is related to one particular cause. If you feel called to support an organization based on their mission, this is a good place to start.",
            "Other organizations, like community centers, do not have a specific cause that they are working towards. They tend to be interested in generally supporting and benefiting the members of the community. Whether you choose an organization that is dedicated to a specific cause or not, this is a good way to start thinking about your charitable actions.",
            "Find an organization. Now that you have identified causes that you are interested in supporting, you can begin to search for organizations. Search with organizations that are aligned with the causes that you care about. For example, you could search “Domestic violence organizations” with your zip code or city and see if there are charities in your area that you can support.",
            "Ask friends and family about what organizations they support. They may be supporting an organization that you hadn’t come across in your search that you connect with. Visit organization’s websites. The majority of charities will have a web presence and most will list what sort of support they need (ex. clothing donations, food donations, monetary).",
            "Rate the organization. Some charities are better, more reputable, and help more people than others. You should take some time to make sure that this organization will distribute your donations to the people who need them. Before you donate your time, resources, and money to an organization it is important to consider its reputation and how effective it is."
          ],
          "notes": []
        },
        {
          "id": 2,
          "locked": true,
          "completed": false,
          "label": "Find ways to Give 2",
          "description": [
            "Look at what your community needs. As you look at ways to give back, you will learn more about the needs of your community and how already established organizations or programs support those needs. You may notice that there is a gap in the services offered in your area, or that organizations aren't reaching certain groups or areas.",
            "Start an organization or program. You may be passionate about promoting literacy and helping kids love to read, and notice that your local school district doesn't offer any after-school programs dedicated to reading. You could start a program that promotes causes that you care about. Look for other people that share your interests and form a group that dedicates their time to working towards that cause.",
            "If you decide that you'd like to start an organization or program in your area, it may be helpful to partner with an established organization or community center in your area. That way, you can tap into their resources and expand their programming. Organize with others to start a club, program, event or organization that you believe will give back to your community. You can use this as an opportunity to educate others about the cause, to raise funds, and to raise awareness.",
            "Think local or think global. Giving back to the community can also mean giving back to the global community, or you could decide to keep your donations closer to home. You may identify national or international organizations that align with the causes that you care about. If you live in an area that a global organization works in, your support for that organization would also indirectly support your own community."
          ],
          "notes": []
        },
        {
          "id": 3,
          "locked": true,
          "completed": false,
          "label": "Give with your Time 1",
          "description": [
            "Donate your human capital. Your human capital refers to the things that make you the person that you are. In respect to charitable giving, this could mean the skill sets that you have, the time you have, and the gifts you have. You can choose to donate your time in a skill specific role. For example, if you are a lawyer, you can offer pro bono legal consulting to women’s shelters, to domestic violence organizations, or to counsel troubled teenagers.",
            "You can also give your time as a volunteer. This could mean volunteering for an hour a week or establishing a long-term relationship with an organization. Giving your gifts would allow you to use a special skill, or gift, that you have to help others. For example, if you have a compassionate heart for animals you could volunteer at an animal shelter to socialize the animals.",
            "Make a schedule. Making a time commitment to an organization will make you much more likely to follow through on your commitment of giving your time. You can start off as slowly as you’d like. You can start by giving an hour or two of your time volunteering at an organization during the month.",
            "Ask you become more engaged with the organization and your community, you may find that you can give more of your time. Make your volunteering a family activity with your significant other and children. This is a great way to teach children about generosity, helping others, charity, and their community.",
            "Ask friends and family to join you. When you’ve found an organization that you care about, you should share your passion with the people you care about. Use charitable events as a time to spend with your friends and family. For example, you could all sign up to run a 5k that supports an organization that you care about."
          ],
          "notes": []
        },
        {
          "id": 4,
          "locked": true,
          "completed": false,
          "label": "Give with your Time 1",
          "description": [
            "Make giving back a habit. Giving back to your community is rewarding for you, for your community, and for the people that you are helping. It can be tempting to associate giving with the holidays, but these organizations need help year round.",
            "Become involved politically. Local politics exert significant influence over a community, and becoming engaged politically can allow you to make a direct impact on the services, funding, and manpower available for your area.",
            "Fundraise for organizations. Most organizations and programs receive their funding from public and private sources, including donations from individuals like you. Raising funds for a group that you care about helps that organization to continue the work that they do, expand to reach more people, and to make more of an impact."
          ],
          "notes": []
        },
        {
          "id": 5,
          "locked": true,
          "completed": false,
          "label": "Give with Your Resources",
          "description": [
            "Assess what you can give. If you have decided to donate your physical resources to an organization, you should take stock of what you can give.",
            "Create a budget with giving in mind. Budgeting is already an important part of our financial health. When you modify your budget to include a section where you set aside money to donate, you can commit to giving financially.",
            "Donate your physical resources. When you’ve collected things that you know that could be used by someone else, you need to make sure that they are gently used, functional, and clean.",
            "Know what to donate. There are many different things that you can donate. Clothes, Rewards points that you’ve accumulated on your rewards credit card or from airline miles, Non-perishable food, Glasses, Old cell phones and old electronics, Furniture, Books, Toiletries"
          ],
          "notes": []
        }
      ],
      "reference": "https://www.wikihow.com/Give-Back-to-the-Community"
    },
    {
      "my_resolutions": false,
      "icon": "/icons/rememberImportantThingsIcon.png",
      "backdrop": "/backdrops/rememberImportantThingsBackdrop.jpg",
      "image_ref": "rememberImportantThings",
      "type": "intellectual",
      "color": "purple",
      "title": "Remember Important Things",
      "overview": "Everyone has different memorization skills, and it's possible to use your strengths to improve your memory. If you frequently forget important information or dates, you can remember important things by implementing reminders and using memorization techniques. While it may take a bit more effort for you to remember things, it’s certainly possible with some time and dedication.",
      "steps": [
        {
          "id": 1,
          "locked": true,
          "completed": false,
          "label": "Use Memorization Tricks 1",
          "description": [
            "Make a mnemonic device to help you remember. Mnemonic devices help make information easier to remember. Create a rhyming song out of the information, or assign an acronym that you won’t forget. This works great with locker combinations, passwords, PINs, and chronological information.",
            "Write or say the information repeatedly to remember it. Writing and speaking are very helpful for remembering information. Try writing down a new phone number or address 20 times when you want to memorize it. Then, turn the paper over and recite the number or address out loud 20 more times. If you don't have a pen or paper, try saying the information out loud to another person, which can also help you remember.",
            "Ask yourself questions about the information. If you’re trying to remember something that you read in a book or article, quiz yourself after you finish a section. Go over the most important information, the main points, and some of the specific information, like statistics, that you read.",
            "Create a memory palace to remember a list of information. Close your eyes and imagine yourself walking through a place that you’re familiar with, like your house, bedroom, or office. As you’re walking, look around and visualize the items that you need to remember in various places, and come up with a funny or crazy story about why they’re there. Keep going until you’ve included all of the information that you need."
          ],
          "notes": []
        },
        {
          "id": 2,
          "locked": true,
          "completed": false,
          "label": "Use Memorization Tricks 1",
          "description": [
            "Link the information to a bizarre or funny made-up story. It’s much easier for people to remember something when there’s a feeling or emotion associated with the memory. Visualize a very vivid funny story about the thing that you need to remember. Make sure you think of every detail, and imagine yourself doing something funny or crazy.",
            "Position sticky notes with the information where you can easily see them. Think about some places where you go everyday, like your kitchen, bathroom, and bedroom. Write down the task, date, or information that you need to remember on a sticky note, and then place it somewhere you’ll definitely see it.",
            "Associate the information with another memory in your mind. When you learn something new, try to link it to an established memory in your mind. If it’s a name, think of someone else you know with that name. If you don’t know anyone with that name, make a note of something distinctive about their appearance, like their hair color, and link the name to their appearance.",
            "Practice remembering things with apps and games. Websites and apps, like MemRise and Anki, have games that help you practice remembering information, tasks, and images. Some games will challenge you to remember the order of chronological events, and others will test your abilities to remember pictures or patterns. Play with these every day to help “exercise” your brain and keep it sharp with their techniques."
          ],
          "notes": []
        },
        {
          "id": 3,
          "locked": true,
          "completed": false,
          "label": "Set Reminders 1",
          "description": [
            "Write down information in a notebook or planner that you carry with you. Keep important dates in a calendar or planner that you can access at any time. Make sure you keep your planner organized, and check ahead during the week to see upcoming dates and activities. You can also use a plain notebook as a planner by converting it into a bullet journal.",
            "Set a reminder on your phone for an important date. Use the calendar function on your phone to remind you about an event or appointment. Set the reminder for a few hours or days before the date so you don’t forget. Then, all you have to do is remember to carry your phone with you!",
            "Sometimes things like email programs will have a calendar that you can mark important dates in, like birthdays. Some will send you an email notice within 10 days of the birthday so you can remember to get a present or make reservations.",
            "Ask your friends or family to remind you of the matter. If you know you’re likely to forget something important, like watering your plants or grabbing your keys before you leave the house, ask whoever is with you to remind you. Saying the task out loud will help you remember, and they might be more likely to remember."
          ],
          "notes": []
        },
        {
          "id": 4,
          "locked": true,
          "completed": false,
          "label": "Set Reminders 2",
          "description": [
            "Take a picture so you remember what you did. After you complete a task, you might have trouble remembering if you did it or not. Use your phone to snap a quick picture, and when you start to question yourself later, check your photos to see if you did it already. If it isn’t in your photos, you’ll know that you didn't do it.",
            "This is especially helpful for daily tasks, like closing the garage door or locking the front door. You can make a habit to delete these photos at the end of the day so your photo roll isn’t cluttered.",
            "Make a back-up plan in case you do forget. When the task or information is so vital that something bad could happen if you forget, organize a back-up plan in case you do. Plan for the worst-case scenario, and use the buddy system to hold you accountable. For extremely vital tasks, set many reminders and use the buddy system to remind you to do it.",
            "For example, if you’re in charge of buying concert tickets for a group of 4 people, but you forget to wake up early enough and they sell out, you should have a back-up plan in place. In this case, your back-up plan could be buying the tickets secondhand on a re-selling website."
          ],
          "notes": []
        }
      ],
      "reference": "https://www.wikihow.com/Remember-Important-Things"
    },
    {
      "my_resolutions": false,
      "icon": "/icons/stopProcrastinatingIcon.png",
      "backdrop": "/backdrops/stopProcrastinatingBackdrop.jpg",
      "image_ref": "stopProcrastinating",
      "type": "lifestyle",
      "color": "navy",
      "title": "Stop Procrastinating",
      "overview": "If you're a chronic procrastinator, you’re familiar with the pain and stress that goes hand in hand with leaving things to the last minute. Even if you want to accomplish or finish a task, you’re likely having trouble getting started in the first place! There are several strategies that can help you stop procrastinating right now (so read fast!), as well as lifestyle changes you can make to avoid future procrastination.",
      "steps": [
        {
          "id": 1,
          "locked": true,
          "completed": false,
          "label": "Change Your Outlook 1",
          "description": [
            "Stop punishing yourself for procrastinating. The more stressed out you are, the harder it’ll be to get your work done. Don’t be angry with yourself. Move on and focus on what you’ve got to do instead.",
            "Guilt and regret are draining emotions. Wasting time yelling at yourself for not starting that 2,000-word essay two weeks ago will only make you extra tired and frustrated. It will also stress you out, likely making it impossible for you to finish your assignment at that time.",
            "Tackle your most important task for 15 minutes. Instead of thinking about the total number of hours you’re about to work for, just start. Tell yourself you’ve only got to do it for 15 minutes. This will deal with the intimidation factor, and you’ll likely spend much longer than 15 minutes on your task before you stop working again.",
            "If 15 minutes still sounds too intimidating, do something for just 3 minutes. Once you come up for air, take a two-minute break. Then start up on another set of 15 minutes of work.",
            "Break tasks down into small chunks. It can be overwhelming to think about finishing a whole essay or getting through an entire week’s worth of tasks. Instead of thinking about everything you have to do like one big obstacle, break it all down into tiny pieces. You’ll be able to get started on the smallest crumb and go forward from there.",
            "Consider trying a specific technique like pomodoro, where breaks happen at planned intervals. Avoid making a long, disorganized to-do list. This is just setting yourself up for failure. Instead, create subcategories like 'Home,' 'Work,' 'Family,' and 'Fun' and just try to cross off a few entries from each list every day."
          ],
          "notes": []
        },
        {
          "id": 2,
          "locked": true,
          "completed": false,
          "label": "Change Your Outlook 2",
          "description": [
            "Start your day with the hardest tasks. Make yourself a plan in the morning and pick the hardest task first. You’ll be most energized in the morning once you’ve eaten breakfast and woken up fully. Tackle the hardest thing on your docket right then. You’ll feel better once it’s done, and then you can move on to a few easier tasks for the rest of the day.",
            "Figure out when you are most motivated and alert and plan out your day so you use this time best. For example, if you're a morning person, do your toughest work right after you wake up. On the other hand, if you tend to be groggy in the morning, you risk making careless errors or frustration by going headfirst into a difficult task.",
            "Give yourself a pep talk for motivation. “Self-talking” is a great way to calm yourself down, get focused, and meet your goals. Talk to yourself, using your name. Tell yourself that you can (and will) do this.",
            "Self-talk by saying something like, “Jenny, I know this week has been hard and you’re tired. You’ve written a million essays before, and you’re going to rock this.” You can also ask yourself questions: “Jenny, why are you nervous about this? You know you can handle it.” Self-talk out loud if you can. It’ll also work in your head if you’re in a public place.",
            "Aim for done over perfect. Imagining the perfect essay, assignment, or project could be what’s holding you back. It’s nothing at all if it’s not finished, so abandon your vision (or fears) of the perfect product. You also can’t fix what doesn’t exist yet.",
            "Promise yourself you’ll get a reward when it’s done. You’re probably dreading the next however many hours you need to finish this task. Just tell yourself that when it’s over, you get to celebrate with one of your favorite things. Use that anticipation to push yourself through the pain."
          ],
          "notes": []
        },
        {
          "id": 3,
          "locked": true,
          "completed": false,
          "label": "Remove Distractions from Your Environment",
          "description": [
            "Pick a workspace that works for you. Figure out where you’ll be doing most of your work, and make it the best environment for limited distraction. It’s especially important to have a dedicated space for work that’s different from the one where you relax. This may be the library, a coffee shop, your local bookstore, or a home office.",
            "Download an app to avoid phone distraction. Smartphones are usually the black holes that suck up all of our time and attention. Of course, there’s an app for that! Quickly download whichever app sounds like it will best address your particular procrastination problem.",
            "Use a program or browser add-on to avoid internet distraction. If constant browsing is your biggest issue, download an application to address your internet addiction. There are a variety of programs available for both Windows and Mac operating systems.[10] If you have more self-control, set a timer before you go on time-wasting websites and get back to work when it rings.",
            "Remove your phone from the space if you need to. If you can’t handle being in the same space as something that’s going to tempt you, address that problem by keeping it in another room or turning it off. This also goes for other devices, including iPads, Kindles, or even computers. If you need to keep your phone on for family or work-related reasons, turn off all your notifications except for texts and/or calls.",
            "Listen to music without lyrics. Many people struggle to work and stay focused in a completely silent room. But if you are listening to music with lyrics, you’ll almost certainly get distracted by the words. Switch to a white-noise machine or instrumental music."
          ],
          "notes": []
        },
        {
          "id": 4,
          "locked": true,
          "completed": false,
          "label": "Avoid Procrastination in the Long Term",
          "description": [
            "Write a to-do list to set goals. Make a record of all the tasks you need to accomplish. The list should include both short-term tasks you need to finish daily and weekly, as well as long-term goals that may take months or even years to accomplish. Seeing it written down will help you plan out the various actions needed to meet all your goals.",
            "Prioritize different goals with set deadlines. Use a planner to schedule your time. Write short-term tasks in daily or weekly lists that include deadlines for each item. Set deadlines for long-term goals by listing them in monthly entries.",
            "Include everything you need to get done in your planner. Say that on Friday your final biology project is due. Set aside at least three nights to finish it. You’ve also got to go to the pharmacy and pick up a new toothbrush and vitamins before you leave for vacation. Do this on Thursday night. You’re also taking the SAT in a month, so spend at least three hours this week practicing vocab.",
            "Try using a strategy like the Eisenhower Box for prioritizing your tasks in an efficient way. Basically, you categorize all you have to do into four categories: tasks that must be done immediately, tasks that can be done later (or rescheduled), tasks that can be delegated to someone else and tasks that aren't important and can be eliminated. The strength of this strategy is that it works well with the tasks you must complete in a given day, but also on longer timescales, like weeks or months.",
            "Avoid multitasking to focus on one goal at a time. Multitasking makes you feel like you’re accomplishing a lot, but it actually prevents you from finishing tasks quickly and effectively. Keep your attention on one goal at a time, and give it your all. This will also help you avoid getting overwhelmed by your busy schedule.",
            "Get a buddy to keep you honest. It’s hard to stay away from distractions and do your work on time when you’re doing it alone. Luckily (or unluckily), everyone struggles with procrastination. Ask a friend or family member if they’d be willing to partner up with you to check in on each other’s work habits and accomplishments. You can plan fun outings with your buddy to reward both of you when you meet your goals. If you keep procrastinating, cancel these events as a little bit of punishment."
          ],
          "notes": []
        }
      ],
      "reference": "https://www.wikihow.com/Stop-Procrastinating"
    },
    {
      "my_resolutions": false,
      "icon": "/icons/tryNewLookIcon.png",
      "backdrop": "/backdrops/tryNewLookBackdrop.jpg",
      "image_ref": "tryNewLook",
      "type": "grooming",
      "color": "fuchsia",
      "title": "Try New Look",
      "overview": "From drastic changes, like dyeing your hair purple, to subtle modifications, like wearing less makeup, changing your look can be fun and exciting but also a little intimidating. Sometimes you might feel like you want to change something, but you just aren’t quite sure of what that something is. Take a look at your hairstyle, wardrobe, attitude, and other variables to decide what kinds of changes you’d like to implement to change your look. [This resolution is designed for females.",
      "steps": [
        {
          "id": 1,
          "locked": true,
          "completed": false,
          "label": "Trying New Hairstyle",
          "description": [
            "Change your hair color for a new look. Get highlights or lowlights, dye your hair a fun color (like blue or purple or pink), experiment with ombre, go platinum blonde or raven black, or any other look that draws your eye and excites you! You can also use things like hair chalk and color sprays to temporarily change your hair color.",
            "Pay attention to what repeatedly catches your eye—if you’re drawn to it, maybe it’s something you should take a chance on. Try paying attention to your skin tone and letting that guide your hair coloring decisions. You can visit a professional salon to have your hair done, or you can try dyeing it on your own or with a friend.",
            "Get a haircut or add extensions for a more permanent change. You could go from long locks to a pixie cut, get bangs, try out an asymmetrical style, have extensions attached, or choose from dozens of other different hairstyles. You could even buzz off all of your hair for a dramatic change! Try choosing a hairstyle that flatters your face.",
            "If you don’t want to do anything drastic to your hair, try getting a simple trim. Even if it’s not a noticeable change, you’ll know it happened and it can help make you feel “fresh.” If you want to try out a new, dramatic style, but aren’t ready to commit to the cut yet, you could try out a wig for a week to see if you like the look. Some different apps that let you “try on” new hairstyles are Virtual Hairstyle, Hair Color Booth, and NewDo.",
            "Style your hair differently to explore new looks without commitment. If you don’t want to make any other changes, try changing how you actually style your hair. You could part your hair on the opposite side or try braiding your hair for a unique style. Try a half-bun, a low ponytail, or a top knot for a change.",
            "The great thing about trying a new hairstyle is that it isn’t permanent! Look up some tutorials on YouTube or Pinterest to learn how to pull off some different looks. You could also try adding some accessories to your hair, like ribbons, clips, headbands, or a flower crown."
          ],
          "notes": []
        },
        {
          "id": 2,
          "locked": true,
          "completed": false,
          "label": "Revamp Your Makeup Routine",
          "description": [
            "Get a professional makeover to learn new makeup techniques. Many makeup and beauty counters will do free makeovers—visit one and ask the worker to explain how and why they are doing what they’re doing. If you have a particular look in mind, you could even ask them to show you how to pull off that look.",
            "Watch how-to videos and tutorials to learn new makeup styles. Maybe you want to learn how to do the perfect cat eyeliner, or perhaps you love the way contouring looks. Check out YouTube or other tutorials on wikiHow to watch videos and learn how to pull off these looks. Doing something new with your makeup may take some extra time at first, but with practice, you’ll get better and faster!",
            "Start wearing less makeup for a more natural look. Maybe you are searching for a simpler style—try limiting how much makeup you wear by eliminating different parts of your routine, like blush or eyeliner or eyeshadow. Or, simply change out bold looks (like dark eyeshadow) for more natural shades. A lot of people find it freeing to stop wearing makeup, though you may feel a little “naked” without it at first. Try taking a picture of yourself bare-faced and study it to appreciate what your face looks like in its natural state.",
            "Find a “signature” lip color to wear every day. From pinks to reds to purples to nudes to blues, there are so many different shades you can choose from! Find a color that draws your eye and that goes well with your skin tone, and start wearing it every day to establish a “signature” look.",
            "Learn how to do your eyeliner in a different way. Choose cat eyeliner to enhance your eyes. Learn how to do winged eyeliner for a more dramatic look. You could even learn how to do designs with your eyeliner for a really creative option. You can use different colored eyeliner, too, for even more variety. Green and brown eyeliners look great with hazel eyes; dark brown or dark blue eyeliners enhance blue eyes; purple, teal, and green eyeliners really make brown eyes stand out."
          ],
          "notes": []
        },
        {
          "id": 3,
          "locked": true,
          "completed": false,
          "label": "Update Your Wardrobe",
          "description": [
            "Choose clothing that suits your personal style and body shape. Try highlighting a certain area of your body by placing a detail there (like a belt around the waist). If you’re curvy, avoid wearing clothes that make you look boxy. Do you see certain outfits or styles on people who you admire? Try imitating their look, even if it feels foreign to you at first. Following your instincts is the best way to change your look in a positive way.",
            "Acquire pieces in neutral tones for a classic look. Visit thrift stores, department stores, local boutiques, and online shops to find items that are subtle. Grays, blacks, creams, and tans are good colors for tops and bottoms. Then you can get some different color accessories and jackets to complement your wardrobe. You don’t have to overhaul your entire wardrobe at once; just start small and expand it over time.",
            "Invest in athletic shoes for a sportier look. Or if you are looking for a more classic look, plain tan, brown, or black flats, sandals, or shoes would be more fitting than brightly colored and patterned ones. For a more creative look, search for shoes that are brightly colored, that have designs on them, and that are different styles, like sandals, wedges, and high heels.",
            "Emulate a fashion icon. When you're revamping your style, it can help to choose an icon to reference for direction. Try finding fashion blogs and magazines that you enjoy to find new, contemporary styles. Choose clothing items that reflect that style, like large, round glasses, colorful tops, and big pieces of jewelry.",
            "Try some new accessories to complement your outfits. Pay attention to designers or fashion icons you like to see what kinds of things they pair with their outfits. It’s totally okay to copy them! From sunglasses, purses, wallets, belts, and jewelry, making a simple switch can really change your look drastically.",
            "Buy a new pair of glasses, whether or not you need a prescription. A new pair of frames can really update your look! Go to a store in person to try out new looks, or load your picture to a frames-specific website to virtually try on different styles. You could get bold, dark frames, cat-eye glasses, brightly colored ones, or even gold-rimmed glasses. Don’t be afraid to try something different from what you’ve done in the past!"
          ],
          "notes": []
        },
        {
          "id": 4,
          "locked": true,
          "completed": false,
          "label": "Improve Emotional and Physical Health",
          "description": [
            "Develop a new exercise routine for more energy. Exercise also helps you feel more confident and boosts endorphins. If there are specific things about your body that you would like to change, like having toned legs or a slimmer waist, look up exercises that specifically address that thing. In general, doing some cardio and some weight lifting nearly every day is enough to make gradual changes to your appearance, and you will feel better, too!",
            "Start a new skincare routine. Take a few minutes to think about and examine your skin. Is it oily or dry? Do you have acne? If you have oily skin, look for products that reduce oiliness. If you have dry skin, look for items that will moisturize your skin. In general, a good skincare routine is repeated in the morning and in the evening before bed, and it includes washing, toning, and moisturizing.",
            "Get 7-9 hours of sleep every night. Half an hour before bed, turn off your electronics, wash your face, and start winding down for the night. Sleep in a cool room with little to no light. When your alarm goes off in the morning, get up right away rather than hitting that snooze button. Getting enough sleep not only makes you more energized and productive, but it will make your skin look better, and you’ll feel more confident if you’re well rested.",
            "Build your self esteem through positive thinking. If you treat yourself well and say good things about yourself, even internally, that attitude projects itself onto the people around you. Try starting every morning with a positivity mantra, like: “I love, respect, and adore my body.”",
            "Keep your shoulders open and your back straight for confident posture. Don’t hunch over or keep your head down to the ground. Walk with your head up high so you can make eye contact with others if you want to, and leave your arms down at your side, rather than crossed in front of you."
          ],
          "notes": []
        }
      ],
      "reference": "https://www.wikihow.com/Change-Your-Look"
    },
    {
      "my_resolutions": false,
      "icon": "/icons/beMentallyAndEmotionallyStrongIcon.png",
      "backdrop": "/backdrops/beMentallyAndEmotionallyStrongBackdrop.jpg",
      "image_ref": "beMentallyAndEmotionallyStrong",
      "type": "intellectual",
      "color": "purple",
      "title": "Be Mentally and Emotionally Strong",
      "overview": "When we’re not able to handle the curveballs life throws at us, things can feel pretty chaotic and out of our control. Good news: Anyone can become mentally and emotionally stronger. You just need to work on building your confidence and resiliency and learn how to regulate your emotions when tough times do come around. It's a journey that doesn't happen overnight, but soon you'll notice a difference in how you handle setbacks.",
      "steps": [
        {
          "id": 1,
          "locked": true,
          "completed": false,
          "label": "Identify Challenges and Setting Goals 1",
          "description": [
            "Understand what it means to be emotionally resilient. Being emotionally and mentally strong, or resilient, means adapting well to things like stress, trauma, adversity, or tragedy. Resilience is not something you are born with — it is a process that can be learned by anyone, and is found in ordinary people",
            "Learn about emotional regulation. Learning to manage your emotions is another important part of becoming emotionally and mentally strong. You may not be able to control what life throws at you, but you always have a choice about how you react. Again, this is something that is not innate; anyone can learn to manage his or her emotions productively.",
            "Identify specific areas that you would like to change. Before you can build up your mental and emotional strength, you will need to take an inventory of your strengths and challenges to determine what you would like to change. Make a list of as many of your strengths and challenges as you can think of. Once you have finished your list, figure out how to turn each of your challenges into a goal that you can work towards.",
            "Acknowledge your strengths. In addition to identifying areas for change, you should take time to celebrate your strengths. Read through the list of your strengths and congratulate yourself for these positive traits. Giving yourself a little pat on the back now and then will help you to stay focused on your positive qualities and help build up your mental and emotional strength."
          ],
          "notes": []
        },
        {
          "id": 2,
          "locked": true,
          "completed": false,
          "label": "Identify Challenges and Setting Goals 2",
          "description": [
            "Consider your past experiences. The reason why you might be feeling like you lack mental or emotional strength may be linked to something that happened to you in the past. Whether this thing happened just a few months ago or when you were very young, it may be affecting your mental and emotional strength. Research has shown that children who are abused, neglected, or otherwise endangered are more likely have emotional and mental issues, which may cause them to abuse drugs or attempt suicide.",
            "Determine if you have an addiction that requires treatment. An addiction to drugs, alcohol, sex, or something else may be damaging your mental and emotional strength. If you think that you are addicted to something, seek help to get rid of your bad habits. You may require treatment if your addiction is severe. Talk to a therapist or a doctor if you think that an addiction may be damaging your mental and emotional strength.",
            "Track your thoughts and feelings in a journal. Journaling can help you to understand what may have caused you to experience these challenges, and it is also a great way to relieve stress.[10] To get started with journaling, choose a comfortable place and plan to devote about 20 minutes per day to writing. You can start by writing about how you are feeling or what you are thinking, or you can use a prompt.",
            "Consider talking to a therapist. Without help, it may be hard to figure out why you feel you are struggling and determine the best way to deal with your feelings. A licensed mental health professional can help you to understand your feelings and help you work through them. Keep in mind that feeling mentally and emotionally fragile may be part of an underlying mental health condition that requires treatment. Talking to a therapist can help you understand what is going on and decide on the best course of action."
          ],
          "notes": []
        },
        {
          "id": 3,
          "locked": true,
          "completed": false,
          "label": "Stay Even-Keeled",
          "description": [
            "Stay away from vices that disturb your mental peace. If you're toying with your mental health by drinking, doing drugs, stealing, lying, and so on, you're detracting from your ability to be emotionally and mentally strong. Start phasing these vices out of your life, or at least limit them so they don't control your behavior and emotions. If you have an addiction, get help.",
            "Take good care of yourself. Exercise, healthy food, rest, and relaxation will help you to develop and maintain your mental and emotional strength. By taking good care of yourself, you are sending your mind signals that you deserve to be taken care of. Make sure that you are devoting enough time to meeting your basic needs for exercise, food, sleep, and relaxation.",
            "Enrich your mind. Challenge yourself to keep learning all the time. You'll get mentally stronger and wiser the more knowledge you accrue. Don't let yourself get stuck in a rut, either mental or physical. Be curious, aware, and informed about the world. Read books, watch good films, go to concerts, go to plays, watch ballets, and take in art in some form. Learn new skills. Branch out in the kitchen, do some DIY projects around the home, plant a garden, learn how to drive a manual car, learn how to fish, train to run a 5K.",
            "Work on your spiritual side. Many people gain strength from paying attention to their spirituality. Having a connection to something greater than yourself - whatever that may be - can imbue the spirit with strength and a sense of purpose. Research has shown that spirituality and prayer help to relieve stress and decrease healing times during an illness. Spirituality can take many different forms, and it's important to find the one that works for you. There's no right way to be spiritual."
          ],
          "notes": []
        },
        {
          "id": 4,
          "locked": true,
          "completed": false,
          "label": "Build Mental and Emotional Strength 1",
          "description": [
            "Set reasonable goals and follow through with them. You can practice building mental strength by setting meaningful goals and working to accomplish them, step by step. Getting from one step to the next requires applying yourself, working through boredom or pain, and sticking it out until you've made it. That's no easy feat, and the more you practice, the better you'll get at achieving your goals.",
            "Make yourself strong against negativity. Negativity can come at you in different ways: it can be from within, in the form of negative thoughts and harmful self-talk, or from the outside, as negative feedback or abuse from other people. While it is beyond a person's control to ever fully remove negativity from her life, there are ways to manage it.",
            "Use positive self-talk to build your mental and emotional strength. Positive daily affirmations can help you develop your mental and emotional strength. Take a few moments every day to look at yourself in the mirror and say something encouraging to yourself. You can either say something that you believe about yourself or something that you would like to believe about yourself.",
            "Learn to stay calm under pressure. When a situation starts to escalate and you can feel your emotions threatening to boil over. When you contain yourself a bit instead of being impulsive and reactive, you have more time to weigh your options and figure out the wisest way forward."
          ],
          "notes": []
        },
        {
          "id": 5,
          "locked": true,
          "completed": false,
          "label": "Build Mental and Emotional Strength 2",
          "description": [
            "Let go of the little things. If you're sensitive to the small annoyances and verbal barbs we all encounter on a daily basis, you will end up devoting time and energy to things that, ultimately, don't matter. When you dwell on these little things and give them your attention or treat them as a major hassle, you not only increase your stress, but you may be increasing your mortality risk. Learning to adjust your attitude so that you take those small, everyday stresses in stride will help keep your stress hormone (cortisol) under control, protecting you from things like lower immune function, increased blood pressure and cholesterol, and an increased risk of heart disease.",
            "Change your perspective. If you tend to get wrapped up in your own problems, find ways to get a different perspective on your life and all its possibilities. Everyone hits a dead end from time to time; those who have emotional and mental strength are able to find another way to get where they're going.",
            "Have a positive outlook. Mentally and emotionally strong people tend not to complain very much. They have as many troubles as everyone else, but they take them in stride and see the bigger picture. Being positive about what's going well in your life, and about the possibilities the future holds, will provide you with more mental and emotional strength to tackle difficult situations. Some studies have even shown that having a positive outlook can benefit your physical health as well.",
            "Be honest with yourself. Being able to face reality might be the biggest sign of a person's emotional and mental strength. If you're going to overcome an obstacle, you need to be able to take it head on. Lying to yourself about what's going on will only end up hurting you in the end."
          ],
          "notes": []
        },
        {
          "id": 6,
          "locked": true,
          "completed": false,
          "label": "Deal With Life Situations",
          "description": [
            "Think before you act. When you're faced with a difficult situation, take as long as you need to think it through before you react or make a decision. This gives you time to get your emotions under control and weigh your options, and it's mandatory no matter what situation you're dealing with.",
            "Examine all angles. In your composed state, before you decide what to do, think clearly about the situation at hand. What exactly happened? What are the possible paths that could be taken? There's always more than one way to handle a problem.",
            "Determine the right path and take it. Use your conscience as your guide. Research has shown that people who make decisions based on what their instincts tell them to do tend to be more satisfied with their decisions than people who carefully weigh them out. Sometimes the answer will be clear, and sometimes it will be extremely difficult to figure out the right thing to do. Don't let the problem fester and get out of hand; make a decision and go for it.",
            "Reflect on your experiences. After you encounter a difficult situation, consider what happened, how you handled it, and how it all turned out. Are you proud of how you behaved? Is there something you would do differently if you could? Try to learn as much as you can from your experiences. Wisdom is only gained through this type of practice. Examining what happened, rather than just trying to put it out of your head, will help you know what to do next time you face a challenge."
          ],
          "notes": []
        }
      ],
      "reference": "https://www.wikihow.com/Be-Mentally-and-Emotionally-Strong"
    },
    {
      "my_resolutions": false,
      "icon": "/icons/practiceYogaDailyIcon.png",
      "backdrop": "/backdrops/practiceYogaDailyBackdrop.jpg",
      "image_ref": "practiceYogaDaily",
      "type": "physical",
      "color": "green",
      "title": "Practice Yoga Daily",
      "overview": "Settling into a daily routine that includes yoga isn't always easy. However, it’s helpful to remember that even 10 minutes of yoga a day can have positive benefits on your physical and mental wellbeing.[1] By making sure to set aside some time daily and vary your yoga practice, you can easily fit yoga into your routine every day.",
      "steps": [
        {
          "id": 1,
          "locked": true,
          "completed": false,
          "label": "Incorporate Yoga into Your Schedule 1",
          "description": [
            "Have your yoga gear ready to go. If you want to practice yoga every day, always have your yoga gear ready to practice at home or in the studio. This can help prevent you from finding excuses to not practice daily. You will need a yoga mat and may want props such as a yoga belt, yoga block, and a large blanket or bolster at hand, too. These pieces of equipment can help improve and deepen your yoga practice as well as making it more comfortable.",
            "Decide when and how long you want to practice. While there is no best time to do yoga, many people like to practice at the same time every day. This can help you ensure that you practice every day. Some people like to practice yoga first thing in the morning. Not only can this energize you, but can also keep you from making excuses to not practice later in the day. Others prefer practicing in the evening to help them sleep.",
            "Some people find that keeping to a routine of the same time and the same place each day is most beneficial. Your mind and your body will associate that time and place with yoga sessions, which can serve as great internal motivation. Be sure to pick a time when you know there will be no interruptions or distractions, such as early in the morning or late at night.",
            "Even if it doesn’t help you to always practice at the same time and place, make an effort to schedule specific times for your practice. Planning ahead can help you stay consistent. You can practice yoga for however long you like. It might be anything from a few rounds of sun salutations to a full 90-minute session. You might consider practicing for different lengths of time each day so that you don’t burn out.",
            "Designate time for yourself every day. Set a specific time for your yoga practice every day. Make sure all that electronics are turned off or unplugged, no one is coming over, and everyone in your household is either not home or otherwise occupied. Let others know that your yoga practice should not be disturbed except in an emergency."
          ],
          "notes": []
        },
        {
          "id": 2,
          "locked": true,
          "completed": false,
          "label": "Incorporate Yoga into Your Schedule 2",
          "description": [
            "Find a comfortable place to practice. You can try yoga at home or in a professional studio. Either way, it’s important to find a designated space so that you can comfortably and easily dedicate yourself to your daily practice. Make sure the place you choose to practice is peaceful and still so that no one can disturb your focus.",
            "You can try different types of studios, and yoga groups if you don’t want to practice at home. Experiment with the different studios near you to find a studio and instructor that you like. You also don’t have to limit yourself to one studio or instructor. Varying your yoga classes can help you establish your practice and keep it from getting boring.",
            "Expect gradual improvement. Daily practice will start to flow through in evident changes in your life, but it won't happen immediately. Sometimes you might feel as though you’re not progressing at all. Give it time and suddenly you may realize that your daily practice is beneficial and having a positive impact on the rest of your day.",
            "Don't make a huge issue out of missing a day here and there. It happens, just pick up from where you left off. Body memory is powerful, so let your body ease back into it without allowing your mind to infect it with anxiety over missed practices!"
          ],
          "notes": []
        },
        {
          "id": 3,
          "locked": true,
          "completed": false,
          "label": "Vary Your Daily Practice",
          "description": [
            "Be regular, not rigorous. It is better to practice yoga every day for a few minutes than to push yourself into a long practice on an irregular basis. Do whatever asanas you like and perfect them before moving on to more difficult poses. Remind yourself that it is better that you're doing some yoga than none at all.",
            "Avoid adopting a negative mindset in which you tell yourself you 'can't' do certain poses. You can, it just may take some (or a lot of) time. Practice regularly and build up poses that lead into the more difficult ones.",
            "Sequence a well-balanced daily practice. “Sequencing,” or putting together asanas that make up a yoga practice, is one of the most difficult parts of practicing yoga, especially if you are doing it at home. Set up different sequence for yourself every day based on the basic formula that most yoga classes follow to help yourself get the most benefits from the practice and keep you from getting bored.",
            "Start your practice with a short meditation and chanting exercise to calm your mind and center your thoughts. Set an intention for your practice just before you begin to practice. Move from a warmup of sun salutations to standing poses, then progress through inversions, backbends, forward bends, and end with savasana, or corpse pose.",
            "Always end your practice with a final relaxation pose. Consider having a mixture of easy and difficult sessions, as well as short and long practice times."
          ],
          "notes": []
        },
        {
          "id": 4,
          "locked": true,
          "completed": false,
          "label": "Incorporate different asanas 1",
          "description": [
            "You do not have to be able to do every yoga asana in existence to have an effective daily practice. Incorporating and mastering different poses from each of the 4 types of asana can help you put together a daily practice which won’t get boring or routine.",
            "Make sure to start with easier asanas and move on to more difficult poses as you master basic ones. Do asanas from each type of pose in the following order: standing poses, inversions, backbends, and forward bends. Add a twisting asana to neutralize and stretch your spine between backbends and forward bends if you like.",
            "Hold each asana for 3-5 breaths. Add standing poses such as vrksasna (tree pose) or the Warrior Series, which is known as Virabhadrasana I, II, and III. As you progress, you can incorporate other standing poses, such as Utthita Trikonasana (Extended Triangle Pose) and Parivrtta Trikonasana (Revolved Triangle Pose).",
            "Add inversions, including mukha vrksasana (handstand), on a wall, until you have enough strength to hold yourself up. Gradually add forearm balance and salamba sirsasana (headstand) as your practice improves.",
            "Add backbends including salabhasana (locust pose), bhujangasana (cobra pose), or setu bandha sarvangasana (bridge pose). Work up to dhanurasana (bow pose) and urdhva dhanurasana (full wheel or upward bow)."
          ],
          "notes": []
        },
        {
          "id": 5,
          "locked": true,
          "completed": false,
          "label": "Incorporate different asanas 2",
          "description": [
            "Add a twist if you need a balance between backbends and forward bends. Twists can get quite deep, so start off with simple variations such as Bharadvajasana (Bharadvaja’s twist) before moving on to more difficult asanas such as ardha matsyendrasana (half lord of the fishes pose).",
            "Add forward bends such as paschimottanasana (seated forward bend), janu sirsasana (heat of the knee pose), or tarasana (star pose) and hold them each for 8-10 balanced breaths.",
            "Finish active practice with closing postures such as salamba sarvangasana (supported shoulder-stand), matsyasana (fish pose), viparita karani (legs up the wall pose).",
            "End your practice in savasana (corpse pose) and enjoy the benefits of your yoga session."
          ],
          "notes": []
        },
        {
          "id": 6,
          "locked": true,
          "completed": false,
          "label": "Change up what you chant",
          "description": [
            "If you enjoy chanting mantras before or after your yoga practice, change up which mantra you’re chanting to mirror either your daily intention or how you’re feeling that day. Each mantra has different vibrations and you want to find one that corresponds to your intention. Repetition of mantras can help you disconnect from stress you may feel and also help keep you focused on your intention.",
            "Om or aum is the most basic and powerful mantra you can chant. This universal mantra will create powerful, positive vibrations in your lower abdomen. It is often combined with the mantra “Shanti,” which means peace in Sanskrit. You can repeat aum as many times as you wish for your chanting.",
            "Maha mantra, which is also called either the great mantra or Hare Krishna, can help you achieve salvation and peace of mind. Repeat the entire mantra as many times as you like. Its words are: Hare Krishna, Hare Krishna, Krishna Krishna, Hare Hare, Hare Rama, Hare Rama, Rama Rama, Hare Hare.",
            "Lokah samastha sukhino bhavantu is a mantra of cooperation and compassion and means “May all beings everywhere be happy and free, and may the thoughts, words, and actions of my own life contribute in some way to that happiness and to that freedom for all.” Repeat this mantra 3 or more times.",
            "Om namah shivaya is a mantra that reminds us of our own divinity and encourages self-confidence and compassion. It means “I bow to Shiva (the supreme deity of transformation who represents the truest, highest self).” Repeat the mantra 3 or more times."
          ],
          "notes": []
        }
      ],
      "reference": "https://www.wikihow.com/Practice-Yoga-Daily"
    }
  ]
}